{"responseHeader": {"zkConnected": true, "status": 0, "QTime": 0, "params": {"q": "*", "fl": "*", "rows": "1000"}}, "response": {"numFound": 11211, "start": 0, "docs": [{"is_archived": 1, "all": ["1", "0", "admin", "rahul.singh@anant.us", "1", "sales.and.marketing", "sales", "sales-and-marketing", "sales", "0", "14012", "Business development vs sales: What’s the difference and which should you hire first?", "https://blog.close.com/business-development-vs-sales", "<img src=\"https://blog.close.com/hs-fs/hubfs/Business%20Development%20vs%20Sales%20What's%20the%20Difference%20and%20Which%20Should%20You%20Hire%20First%20copy-2.jpg?width=700&amp;name=Business%20Development%20vs%20Sales%20What's%20the%20Difference%20and%20Which%20Should%20You%20Hire%20First%20copy-2.jpg\" alt=\"business-development-vs-sales\" width=\"700\" srcset=\"https://blog.close.com/hs-fs/hubfs/Business%20Development%20vs%20Sales%20What's%20the%20Difference%20and%20Which%20Should%20You%20Hire%20First%20copy-2.jpg?width=350&amp;name=Business%20Development%20vs%20Sales%20What's%20the%20Difference%20and%20Which%20Should%20You%20Hire%20First%20copy-2.jpg 350w, https://blog.close.com/hs-fs/hubfs/Business%20Development%20vs%20Sales%20What's%20the%20Difference%20and%20Which%20Should%20You%20Hire%20First%20copy-2.jpg?width=700&amp;name=Business%20Development%20vs%20Sales%20What's%20the%20Difference%20and%20Which%20Should%20You%20Hire%20First%20copy-2.jpg 700w, https://blog.close.com/hs-fs/hubfs/Business%20Development%20vs%20Sales%20What's%20the%20Difference%20and%20Which%20Should%20You%20Hire%20First%20copy-2.jpg?width=1050&amp;name=Business%20Development%20vs%20Sales%20What's%20the%20Difference%20and%20Which%20Should%20You%20Hire%20First%20copy-2.jpg 1050w, https://blog.close.com/hs-fs/hubfs/Business%20Development%20vs%20Sales%20What's%20the%20Difference%20and%20Which%20Should%20You%20Hire%20First%20copy-2.jpg?width=1400&amp;name=Business%20Development%20vs%20Sales%20What's%20the%20Difference%20and%20Which%20Should%20You%20Hire%20First%20copy-2.jpg 1400w, https://blog.close.com/hs-fs/hubfs/Business%20Development%20vs%20Sales%20What's%20the%20Difference%20and%20Which%20Should%20You%20Hire%20First%20copy-2.jpg?width=1750&amp;name=Business%20Development%20vs%20Sales%20What's%20the%20Difference%20and%20Which%20Should%20You%20Hire%20First%20copy-2.jpg 1750w, https://blog.close.com/hs-fs/hubfs/Business%20Development%20vs%20Sales%20What's%20the%20Difference%20and%20Which%20Should%20You%20Hire%20First%20copy-2.jpg?width=2100&amp;name=Business%20Development%20vs%20Sales%20What's%20the%20Difference%20and%20Which%20Should%20You%20Hire%20First%20copy-2.jpg 2100w\" /><p>What’s the difference between business development and sales? Many founders we talk to believe the terms are interchangeable—simply two different ways to describe the same function… right? Not quite. Today, we’re talking <strong>business development vs sales</strong>.</p><p>Let’s start by clearly defining both <strong>business development and sales</strong>. Then, we’ll dig deeper into the differences, how they support each other, and which function needs to be your focus based on the stage your company is at today.</p><p><strong>Want to take your sales game to a new level? Get free access to our ultimate sales resource library today.</strong></p><p><a href=\"https://close.com/resources/startup-sales-resource-bundle/\" class=\"button small primary\" target=\"_blank\">ACCESS THE COMPLETE SALES LIBRARY NOW</a></p><h3><strong>What is business development?</strong></h3><p><strong>The definition of business development is generating qualified new leads.</strong> The purpose of business development (in the context of a sales team—NOT in terms of product validation) is to research, prospect and create a pipeline of targeted potential customers to pass off to sales for further vetting and closing.</p><h3><strong>What is sales?</strong></h3><p><strong>The definition of sales is generating transactions.</strong> The sole focus of a mature sales team is to close deals with the qualified leads that are coming from either your business development efforts or other <a href=\"https://blog.close.com/lead-generation\" rel=\"noopener\" target=\"_blank\">lead generation strategies</a> that are designed to start conversations with the right potential customers.</p><h3><strong>So… what’s the difference between business development and sales?</strong></h3><p>Put simply, business development comes first. It’s the act of generating well-researched, qualified leads to hand off to your sales team. <strong>Business development is all about generating leads</strong>, and the job titles most often associated with business development are roles like, Business Development Rep (BDR) or Sales Development Rep (SDR).</p><p>Sales comes second, and is wholly concerned with <a href=\"https://blog.close.com/close-sale\" rel=\"noopener\" target=\"_blank\">closing a winning deal</a> with the qualified prospects that come from your organization’s business development activities. <strong>Sales is all about transactions.</strong> Titles for sales roles vary widely, but typically form around phrases like Sales Representative, Account Manager or Account Executive. </p><p>Moreover, when you’re <a href=\"https://blog.close.com/sales-management-new-managers-guide-to-building-a-sales-team\" rel=\"noopener\" target=\"_blank\">building a sales team</a> from the ground up, it can be difficult to decide which role (business development vs sales) you should hire first—or to bring on more of in the early days.</p><p>The answer, as with most things in business, is… well, <em>it depends</em>.</p><p>Now that you’ve got a clear definition of the difference between business development and sales, start by first asking yourself which one sounds like a higher priority within your organization right now. Which role do you truly need today? </p><p>If you’ve gotten clear market validation for your solution and are consistently closing a high proportion of the prospects you speak with, but just need a higher volume of leads to continue flowing through your pipeline, then hiring a business development rep and training them on how to prospect for the right leads should be your number one priority.</p><p>If you have more qualified inbound leads than you know what to do with, but you simply don’t have enough time to follow up with every lead, schedule a meeting, do a demo and close the deal, then your focus should be on getting more sales reps on board who can help close more of your hot leads.</p><p>Sounds pretty straightforward, but the reality is that it can take a while to get to this stage.</p><p>In the earlier phases of your business (or before acquiring funding as a startup), it’s natural for founders and other members of the team to take on both business development and sales-related responsibilities while resources are constrained before <a href=\"https://blog.close.com/sales-hiring-101-for-startups\">sales hiring</a> becomes a viable option.</p><p>As long as the founder-driven sales stage is working well and your revenue is growing, that’s ok for a while. </p><p>Over time though, the separation of the two roles should become more pronounced and specialized as your business begins to scale and you can afford to invest in better solving your bigger problem—generating more leads or bringing on salespeople to close more of the leads you already have.</p><h2><strong>Why you need to separate business development and sales</strong></h2><p>Let’s examine a few of the critical reasons why your business stands to benefit immensely by separating the roles of business development and sales.</p><h3><strong>Creating domain expertise in your organization</strong></h3><p>Since the advent of the world’s first automobile manufacturing lines in the early 1900’s, <a href=\"https://www.investopedia.com/terms/s/specialization.asp\" rel=\"noopener\" target=\"_blank\">labor specialization</a> has proliferated into countless other industries with massively positive effects.</p><p><strong>Division of labor:</strong> Known as the separation of tasks within any system, the primary goal of clearly dividing tasks within your sales team, is to allow individuals to specialize within their roles.</p><p>Anyone who spends the majority of their day executing the same sets of tasks (that ladder up to a very clear goal) is likely going to build expertise much quicker than their counterparts who spend the day task-switching between multiple different roles and goals. </p><p>Separating business development and sales within your organization is no exception. When you allow members of your sales team to focus solely on either prospecting or closing, they’ll develop a level of expertise at their role that’s otherwise very difficult to achieve.</p><p>Instead of splitting their time (and mental capacity), or task-switching throughout their entire day, your business development reps are able to focus on doing everything they can to bring more qualified prospects into the company’s pipeline. Conversely, your sales reps are empowered to work on nothing but the key activities in <a href=\"https://blog.close.com/how-to-build-a-sales-process-that-gets-results\" rel=\"noopener\" target=\"_blank\">your sales process</a> that are proven to close more deals and generate transactions. </p><p>Creating an environment that accelerates the development of expertise is priceless in terms of organizational benefits—you’ll be able to generate more leads <em>and</em> close more of them.</p><h3><strong>Individual productivity gains</strong></h3><p>We touched on this briefly in the context of rapidly building expertise within your sales organization as a result of separating business development and sales, but it’s worth highlighting the productivity gains your team will experience at the individual level too.</p><p>When you have salespeople that are also doing their own prospecting (researching, qualifying, initial outreach), their calendars can quickly fill up with a myriad of different activities like conducting research, <a href=\"https://blog.close.com/b2b-cold-calling-tips\" rel=\"noopener\" target=\"_blank\">cold calling</a> from a list of inbound leads and <a href=\"https://blog.close.com/5-cold-email-templates-that-will-generate-warm-leads-for-your-sales-team\" rel=\"noopener\" target=\"_blank\">sending cold emails</a> to prospects. Their calendars can quickly look like…</p><p><img src=\"https://blog.close.com/hs-fs/hubfs/Business%20development%20vs%20sales%20task%20switching%20costs-1.jpg?width=800&amp;name=Business%20development%20vs%20sales%20task%20switching%20costs-1.jpg\" alt=\"sales-cognitive-switching\" width=\"800\" srcset=\"https://blog.close.com/hs-fs/hubfs/Business%20development%20vs%20sales%20task%20switching%20costs-1.jpg?width=400&amp;name=Business%20development%20vs%20sales%20task%20switching%20costs-1.jpg 400w, https://blog.close.com/hs-fs/hubfs/Business%20development%20vs%20sales%20task%20switching%20costs-1.jpg?width=800&amp;name=Business%20development%20vs%20sales%20task%20switching%20costs-1.jpg 800w, https://blog.close.com/hs-fs/hubfs/Business%20development%20vs%20sales%20task%20switching%20costs-1.jpg?width=1200&amp;name=Business%20development%20vs%20sales%20task%20switching%20costs-1.jpg 1200w, https://blog.close.com/hs-fs/hubfs/Business%20development%20vs%20sales%20task%20switching%20costs-1.jpg?width=1600&amp;name=Business%20development%20vs%20sales%20task%20switching%20costs-1.jpg 1600w, https://blog.close.com/hs-fs/hubfs/Business%20development%20vs%20sales%20task%20switching%20costs-1.jpg?width=2000&amp;name=Business%20development%20vs%20sales%20task%20switching%20costs-1.jpg 2000w, https://blog.close.com/hs-fs/hubfs/Business%20development%20vs%20sales%20task%20switching%20costs-1.jpg?width=2400&amp;name=Business%20development%20vs%20sales%20task%20switching%20costs-1.jpg 2400w\" /></p><p>Known as <a href=\"https://en.wikipedia.org/wiki/Cognitive_shifting\" rel=\"noopener\" target=\"_blank\">cognitive switching</a>, the act of consciously switching from one task to another within your day can leave you mentally exhausted. On top of that, studies <a href=\"http://www.apa.org/research/action/multitask.aspx\" rel=\"noopener\" target=\"_blank\">have shown</a> the quality of your work declines dramatically the more frequently you switch between tasks.</p><p>Psychologist <a href=\"https://lsa.umich.edu/psych/people/faculty/demeyer.html\" rel=\"noopener\" target=\"_blank\">David Meyer, PhD</a>, director of the University of Michigan's Brain, Cognition, and Action Laboratory explains, “Although switching costs may be relatively small, sometimes just a few tenths of a second per switch, they can add up to large amounts when people switch repeatedly back and forth between tasks. Thus, multitasking may seem efficient on the surface, but may actually take more time in the end and involve more error.” </p><p>Meyer reports that even brief mental blocks created by shifting between tasks <strong>can cost as much as 40%</strong> of someone's productive time in a given day—time that you can’t afford to lose in a startup or SMB.</p><p>When you separate the responsibilities of business development and sales within your organization, you’re grouping similar activities together and making individuals responsible for a limited set of goals that are directly impacted by the activities they’re expected to do on a daily basis (having a clear connection to impact being <a href=\"https://open.buffer.com/meaningful-work/\" rel=\"noopener\" target=\"_blank\">one of the three things</a> that make work most meaningful).</p><p>That elimination of multiple different types of goals allows members of your sales team to work on fewer tasks—thus empowering them to execute on single tasks for focused blocks of time. Which allows their calendars to look much more like…  </p><p><img src=\"https://blog.close.com/hs-fs/hubfs/Business%20development%20vs%20sales%20dream%20calendar%20for%20business%20dev%20rep.jpg?width=1000&amp;name=Business%20development%20vs%20sales%20dream%20calendar%20for%20business%20dev%20rep.jpg\" alt=\"dream-calendar-for-business-dev-rep\" width=\"1000\" srcset=\"https://blog.close.com/hs-fs/hubfs/Business%20development%20vs%20sales%20dream%20calendar%20for%20business%20dev%20rep.jpg?width=500&amp;name=Business%20development%20vs%20sales%20dream%20calendar%20for%20business%20dev%20rep.jpg 500w, https://blog.close.com/hs-fs/hubfs/Business%20development%20vs%20sales%20dream%20calendar%20for%20business%20dev%20rep.jpg?width=1000&amp;name=Business%20development%20vs%20sales%20dream%20calendar%20for%20business%20dev%20rep.jpg 1000w, https://blog.close.com/hs-fs/hubfs/Business%20development%20vs%20sales%20dream%20calendar%20for%20business%20dev%20rep.jpg?width=1500&amp;name=Business%20development%20vs%20sales%20dream%20calendar%20for%20business%20dev%20rep.jpg 1500w, https://blog.close.com/hs-fs/hubfs/Business%20development%20vs%20sales%20dream%20calendar%20for%20business%20dev%20rep.jpg?width=2000&amp;name=Business%20development%20vs%20sales%20dream%20calendar%20for%20business%20dev%20rep.jpg 2000w, https://blog.close.com/hs-fs/hubfs/Business%20development%20vs%20sales%20dream%20calendar%20for%20business%20dev%20rep.jpg?width=2500&amp;name=Business%20development%20vs%20sales%20dream%20calendar%20for%20business%20dev%20rep.jpg 2500w, https://blog.close.com/hs-fs/hubfs/Business%20development%20vs%20sales%20dream%20calendar%20for%20business%20dev%20rep.jpg?width=3000&amp;name=Business%20development%20vs%20sales%20dream%20calendar%20for%20business%20dev%20rep.jpg 3000w\" /></p><p>The fewer objectives your individual contributors (both in business development and sales roles) are responsible for delivering against, the more they’ll be able to focus on excelling and being more productive on the limited tasks at hand.</p><h3><strong>Business development requires more effort than it used to</strong></h3><p>The core functions of business development haven’t changed much in recent years, but the process of prospecting and qualifying leads<em> has</em> become much more nuanced.   </p><p>Business development roles are still charged with two main responsibilities:</p><ul><li><strong>Prospecting:</strong> Identifying companies and people that may be interested in purchasing your product or service</li>\n<li><strong>Qualifying:</strong> Determining if your prospect is ready, willing and able to buy </li>\n</ul><p>Once a lead is qualified and has a strong likelihood of converting into becoming a paying customer, they’re passed off to the sales team for closing (and if need be <a href=\"https://blog.close.com/negotiate\" rel=\"noopener\" target=\"_blank\">negotiating</a> the terms of the contract).</p><p>This means that business development reps do not <em>ideally</em> have quotas. They’re responsible for bringing in enough qualified leads to generate a certain amount of revenue, but actually <a href=\"https://blog.close.com/close-sale\" rel=\"noopener\" target=\"_blank\">closing the sale</a> and turning leads into customers is beyond their direct control.</p><p><strong>So, what’s changed in the world of business development?</strong></p><p>It’s become increasingly difficult to reach decision-makers and to engage them the way they want, when they want. Hell, I can’t even remember the last time I answered a call from a number I didn’t recognize—let alone respond to unsolicited sales emails. </p><p>The proliferation of conversational sales and marketing tools like <a href=\"https://www.drift.com/\" rel=\"noopener\" target=\"_blank\">Drift</a> are proof of this dramatic shift. Your customers time is valuable, and giving them the ability to control when and how they interact with you is a serious experience upgrade, therefore your <a href=\"https://blog.close.com/create-sales-plan\" rel=\"noopener\" target=\"_blank\">sales plan</a> needs to grow and adapt with this shift. </p><p>Beyond just better managing the experience of your inbound leads, it also takes more time to adequately research prospects, and requires more touch points on a lead in order to capture their attention.</p><p>Business development is more about relationship-building than ever, making it a standalone full-time position on any sales team.</p><p>At the end of the day, it’s not a smart investment to have someone responsible for a new deal quota, shifting gears between prospecting, demoing and closing within their work day.</p><h2><strong>How business development and sales work together (4 common questions)</strong></h2><p>Now that we’re clear about the separation between business development vs sales, let’s talk about how the two roles should best work collaboratively together, for maximum effectiveness on your sales team.</p><h3><strong>1. When should business development pass a lead on to sales?</strong></h3><p>Your sales team has quotas they need to hit, which means they can’t waste time talking to prospects that aren’t already <a href=\"https://blog.close.com/qualify\" rel=\"noopener\" target=\"_blank\">well-qualified.</a> Otherwise, they'll be wasting time and energy chasing the wrong leads and diluting their close rate.</p><p>Business development reps should pass a lead on to sales <strong>as soon as they’re qualified</strong>. However, that doesn’t mean business development teams and sales teams shouldn’t have a collaborative work relationship.</p><p><a href=\"https://www.wework.com/\" rel=\"noopener\" target=\"_blank\">WeWork</a> VP of Business Development, <a href=\"http://startofthedeal.com/\" rel=\"noopener\" target=\"_blank\">Scott Pollack</a> explains, “business development teams should be identifying, evaluating, and pursuing opportunities to create long-term value for a company. This means BD teams and sales teams should happily coexist—the sales team gets to work on closing opportunities that can drive revenue <em>today</em>, while the BD team focuses their attention on opportunities to open new channels and drive a flood of new leads for tomorrow.”</p><p>As Pollack suggests, it’s incredibly important that business development teams focus their time, effort and energy on building relationships only with the most qualified leads that stand a chance of becoming happy customers. Then, they’re worthy of being handed off to sales.</p><p>How do you know when a lead is fully qualified and ready to be closed? That can vary a bit based on the type of product you’re selling and the market you’re serving, but starting with choosing from these <a href=\"https://resources.close.com/qualifying-questions\" rel=\"noopener\" target=\"_blank\">42 B2B qualifying questions</a> to ask your prospects won’t hurt. </p><p>In order to qualify your prospects, you’ll want to accurately gauge how well they match your <a href=\"https://sixteenventures.com/ideal-customer-profile\" rel=\"noopener\" target=\"_blank\">ideal customer profile</a> with key information around company size, location and industry. </p><p>Next, you want to assess their needs to make sure there’s a true use case for your product, develop an understanding of their purchasing process to make sure it’s a match with your selling process, and assess other competitive options they may be considering.</p><p>If everything checks out and the prospect still appears to be a strong potential customer, then they’re qualified—and ready to be closed by your sales team.</p><h3><strong>2. Should there be overlap between business development and sales?</strong></h3><p>In terms of day-to-day activities? <strong>No, not really</strong>.</p><p>Business development should be wholly tasked with prospecting and qualifying. Sales should be focused only on closing those qualified leads and generating transactions.</p><p>However, your business development reps and sales reps <em>do</em> need to be on the same page about who your ideal customers are—their characteristics, qualities and the kinds of problems your offering can best help them with.</p><p>Due to the rapidly changing environment in startups, this requires frequent cross-team collaboration.</p><p>As <a href=\"https://www.creativelive.com/\" rel=\"noopener\" target=\"_blank\">CreativeLive</a> Director of Partnerships and Business Development, <a href=\"https://www.linkedin.com/in/kimberlyannmurphy/\" rel=\"noopener\" target=\"_blank\">Kimberly Pousman</a> explains, “there not only <em>should be</em> overlap between business development and sales, but there <em>needs to be</em> overlap, whether you personally want it or not.” </p><p>Pousman continues, “One of the keys to being great in either a business development or sales role, is asking the right questions. When you’re looking to grow and expand, you need to ask the right questions, experiment and actively source feedback from others—so if your teams are operating in a silo, they’ll miss out on valuable opportunities to learn from each other and advance your growth rate.”</p><p>Furthermore, the downstream effect is that if this alignment between business development and sales teams isn’t up to par, your sales reps are going to have a difficult time closing enough deals with the leads they’ve got, which leads to frustration and a close rate below the <a href=\"https://www.pointclear.com/blog/what-should-the-sales-close-rate-be\" rel=\"noopener\" target=\"_blank\">20-30% industry average</a> for SaaS.</p><p>If your sales team’s close rate is below 20%, they’re either not closing as well as they should, or your leads aren’t qualified enough.</p><h3><strong>3. What’s the difference in the day-to-day activities of business development reps and sales reps?</strong></h3><p>While the responsibilities of a business development rep can vary a bit based on the unique needs and internal demands of an organization, in general they’re responsible for two main tasks that sit at the core of this role:</p><ul><li><strong>Managing inbound leads:</strong> This translates into working through an internal list, <a href=\"https://blog.close.com/qualify\" rel=\"noopener\" target=\"_blank\">qualifying leads</a> from various marketing campaigns and classifying the right ones as sales opportunities to be passed on to the sales team for further vetting and closing.</li>\n<li><strong>Leading outbound prospecting:</strong> On the flip side, this kind of outreach involves researching and contacting potential customers that haven’t proactively expressed interest in your product through cold calls and cold emails—with the goal of qualifying sales opportunities for your sales team. </li>\n</ul><p>On the inbound side of things, business development reps sit metaphorically between marketing and sales, filtering marketing leads and qualifying them before assigning them to the right sales rep that can move on to <a href=\"https://blog.close.com/close-sale\" rel=\"noopener\" target=\"_blank\">close the sale</a>.</p><p>When it comes to outbound, business development reps need to first go through your organization’s <a href=\"https://blog.close.com/unstoppable-sales-team\" rel=\"noopener\" target=\"_blank\">sales training</a> process so that they have a clear picture of who your ideal customers are before they go out and begin starting conversations with prospects. Depending upon the size of your company, your business development reps may or may not start with the beginning task of researching prospects before sending an email or calling.</p><p>Ultimately though, the goal of any outbound business development work is to start a conversation and <a href=\"https://www.forbes.com/sites/samanthaharrington/2017/05/26/how-to-create-strong-sales-relationships/\" rel=\"noopener\" target=\"_blank\">develop a relationship</a> that can be passed on to sales for closing. Everything a business development rep does, should revolve around finding more prospects, qualifying the right ones and routing them to your sales team for closing.</p><p><strong>Now, let’s talk about the responsibilities of sales reps.</strong></p><p>Keeping in mind slight differences to match your unique internal needs, most sales representatives are charged with the following main responsibilities:</p><ul><li><strong>Selling:</strong> Closing deals (ideally with pre-qualified leads from your business development team to save time) using solid arguments and <a href=\"https://blog.close.com/10-objection-handling-techniques-every-b2b-salesperson-should-know\" rel=\"noopener\" target=\"_blank\">objection management</a> with prospective customers.</li>\n<li><strong>Maintaining relationships:</strong> Although a prospect might not be a fit to purchase your product or service today, that doesn’t mean they won’t be in a completely different position 6 months or a year from now—so keeping in touch with leads to encourage future sales is a major part of a sales rep’s responsibilities.</li>\n</ul><p>Most sales representative roles work against a <a href=\"https://blog.close.com/end-of-year-sales\" rel=\"noopener\" target=\"_blank\">sales quota</a>—a thoughtfully calculated monthly or quarterly minimum for the number of customers (or revenue figure) they’re responsible to close. Sales reps are often incentivized with increasing levels of bonus payouts for hitting and exceeding quota within a given period.</p><p>The intense focus on hitting specific customer or revenue benchmarks each quarter is very intentionally designed to encourage sales reps to spend all of their time only on revenue-driving activities. More meetings. More product demos. More sales calls with qualified leads. More contracts sent out for approval. More <a href=\"https://blog.close.com/follow-up\" rel=\"noopener\" target=\"_blank\">follow up emails</a> delivered.</p><p>In a mature sales organization, that means sales reps are empowered to spend less (or zero) time researching prospects, qualifying leads, and booking meetings. Those are activities a business development rep should be helping out with.</p><h3><strong>4. How does a business development call (or email) differ from that of a sales rep?</strong></h3><p>The biggest difference between the calls and emails that business development reps send vs those of a sales rep, is that most business development activities are done toward either completely or relatively <em>cold</em> prospects—meaning that these prospects have likely had little to no interaction with the company before this initial contact is made. </p><p>That’s when brushing up on your <a href=\"https://blog.close.com/5-cold-email-templates-that-will-generate-warm-leads-for-your-sales-team\" rel=\"noopener\" target=\"_blank\">cold emails</a> and <a href=\"https://blog.close.com/b2b-cold-calling-tips\" rel=\"noopener\" target=\"_blank\">cold calling</a> skills come into play.</p><p>By the time a sales rep is brought on to an account, the relationship has already been established and the lead is qualified, making the communications much more <em>warm</em> than those of a business development rep. The conversation with a sales rep is about how to make a mutually beneficial deal happen, rather than gauging the initial interest or need.</p><h2><strong>Bonus: The key traits you need to look for in every business development (and sales) hire</strong></h2><p>Bringing the right business development and salespeople onto your sales team is crucial in making meaningful progress toward growing your business. If your candidates don’t exhibit these key traits, our advice is to keep searching for the right people that <em>will</em> have a positive impact on your team.</p><h3><strong>Communication and people skills</strong></h3><p>If you hope to cultivate strong relationships with prospects and customers alike, having strong communication and people skills—like the ability to lead a friendly <a href=\"https://blog.close.com/negotiate\" rel=\"noopener\" target=\"_blank\">negotiation</a> from start to finish so that the new customers you bring on are pleased with their decision, is crucial.</p><p>Navigating the process of converting a lead into a paying customer requires the ability to empathize; to fully understand your prospect’s situation and the use case they’ll have for your product to make sure that they’ll truly benefit from your offering.</p><h3><strong>Hunger and drive</strong></h3><p>The most successful salespeople (and business development reps) have an internal drive that pushes them forward and propels them to achieve their sales goals.</p><p> In the face of a challenge, they’re not discouraged—rather, they look forward to the opportunity to excel, surpass previous expectations and move up to the next level. They’re often incentivized by the prospect of <a href=\"https://www.ryrob.com/make-money-online/\" rel=\"noopener\" target=\"_blank\">earning more money</a>, and respond well to financial rewards for performance improvements.</p><h3><strong>Discipline and confidence</strong></h3><p>Discipline and the confidence in your process beats motivation every single day of the week when you’ve just gotten ten rejections in a row. No matter how skilled or experience you are, in sales there will be moments of defeat that can drain your motivation levels.</p><p>The best salespeople know that sales is a numbers game, and that the only way to recover from rejection &amp; failure is to pick up the phone (or get back into your email) and keep executing. Having the right tools and systems, like our <a href=\"https://close.com/calling/automation/power-dialer/\" rel=\"noopener\" target=\"_blank\">Power Dialer</a> will also help keep your team on track and reaching peak productivity levels each day.</p><h3><strong>They’re consultants at heart</strong></h3><p>Just because a salesperson has mastered every tactic in the book and can sell ice to an eskimo doesn’t mean they’re going to bring in customers that’ll <em>still be happy</em> with their purchase decision one, three, six months down the line.</p><p>When hiring a business development or sales rep, look for people that view their role as partnering with prospects to make sure there’s a mutual win-win in each potential deal—ensuring that the customer has a genuine need for the product and that they’re actually a fit for your ideal customer persona of people and companies you want to serve in the first place.</p><p><strong>Want to take your sales game to a new level? Get free access to our ultimate sales resource library today.</strong></p><p><a href=\"https://close.com/resources/startup-sales-resource-bundle/\" class=\"button small primary\" target=\"_blank\">ACCESS THE COMPLETE SALES LIBRARY NOW</a></p>", "What’s the difference between business development and sales? Many founders we talk to believe the terms are interchangeable—simply two different ways to describe the same function… right? Not quite. Today, we’re talking business development vs sales . Let’s start by clearly defining both business development and sales . Then, we’ll dig deeper into the differences, how they support each other, and which function needs to be your focus based on the stage your company is at today. Want to take your sales game to a new level? Get free access to our ultimate sales resource library today. ACCESS THE COMPLETE SALES LIBRARY NOW What is business development? The definition of business development is generating qualified new leads. The purpose of business development (in the context of a sales team—NOT in terms of product validation) is to research, prospect and create a pipeline of targeted potential customers to pass off to sales for further vetting and closing. What is sales? The definition of sales is generating transactions. The sole focus of a mature sales team is to close deals with the qualified leads that are coming from either your business development efforts or other lead generation strategies that are designed to start conversations with the right potential customers. So… what’s the difference between business development and sales? Put simply, business development comes first. It’s the act of generating well-researched, qualified leads to hand off to your sales team. Business development is all about generating leads , and the job titles most often associated with business development are roles like, Business Development Rep (BDR) or Sales Development Rep (SDR). Sales comes second, and is wholly concerned with closing a winning deal with the qualified prospects that come from your organization’s business development activities. Sales is all about transactions. Titles for sales roles vary widely, but typically form around phrases like Sales Representative, Account Manager or Account Executive. Moreover, when you’re building a sales team from the ground up, it can be difficult to decide which role (business development vs sales) you should hire first—or to bring on more of in the early days. The answer, as with most things in business, is… well, it depends . Now that you’ve got a clear definition of the difference between business development and sales, start by first asking yourself which one sounds like a higher priority within your organization right now. Which role do you truly need today? If you’ve gotten clear market validation for your solution and are consistently closing a high proportion of the prospects you speak with, but just need a higher volume of leads to continue flowing through your pipeline, then hiring a business development rep and training them on how to prospect for the right leads should be your number one priority. If you have more qualified inbound leads than you know what to do with, but you simply don’t have enough time to follow up with every lead, schedule a meeting, do a demo and close the deal, then your focus should be on getting more sales reps on board who can help close more of your hot leads. Sounds pretty straightforward, but the reality is that it can take a while to get to this stage. In the earlier phases of your business (or before acquiring funding as a startup), it’s natural for founders and other members of the team to take on both business development and sales-related responsibilities while resources are constrained before sales hiring becomes a viable option. As long as the founder-driven sales stage is working well and your revenue is growing, that’s ok for a while. Over time though, the separation of the two roles should become more pronounced and specialized as your business begins to scale and you can afford to invest in better solving your bigger problem—generating more leads or bringing on salespeople to close more of the leads you already have. Why you need to separate business development and sales Let’s examine a few of the critical reasons why your business stands to benefit immensely by separating the roles of business development and sales. Creating domain expertise in your organization Since the advent of the world’s first automobile manufacturing lines in the early 1900’s, labor specialization has proliferated into countless other industries with massively positive effects. Division of labor: Known as the separation of tasks within any system, the primary goal of clearly dividing tasks within your sales team, is to allow individuals to specialize within their roles. Anyone who spends the majority of their day executing the same sets of tasks (that ladder up to a very clear goal) is likely going to build expertise much quicker than their counterparts who spend the day task-switching between multiple different roles and goals. Separating business development and sales within your organization is no exception. When you allow members of your sales team to focus solely on either prospecting or closing, they’ll develop a level of expertise at their role that’s otherwise very difficult to achieve. Instead of splitting their time (and mental capacity), or task-switching throughout their entire day, your business development reps are able to focus on doing everything they can to bring more qualified prospects into the company’s pipeline. Conversely, your sales reps are empowered to work on nothing but the key activities in your sales process that are proven to close more deals and generate transactions. Creating an environment that accelerates the development of expertise is priceless in terms of organizational benefits—you’ll be able to generate more leads and close more of them. Individual productivity gains We touched on this briefly in the context of rapidly building expertise within your sales organization as a result of separating business development and sales, but it’s worth highlighting the productivity gains your team will experience at the individual level too. When you have salespeople that are also doing their own prospecting (researching, qualifying, initial outreach), their calendars can quickly fill up with a myriad of different activities like conducting research, cold calling from a list of inbound leads and sending cold emails to prospects. Their calendars can quickly look like… Known as cognitive switching , the act of consciously switching from one task to another within your day can leave you mentally exhausted. On top of that, studies have shown the quality of your work declines dramatically the more frequently you switch between tasks. Psychologist David Meyer, PhD , director of the University of Michigan's Brain, Cognition, and Action Laboratory explains, “Although switching costs may be relatively small, sometimes just a few tenths of a second per switch, they can add up to large amounts when people switch repeatedly back and forth between tasks. Thus, multitasking may seem efficient on the surface, but may actually take more time in the end and involve more error.” Meyer reports that even brief mental blocks created by shifting between tasks can cost as much as 40% of someone's productive time in a given day—time that you can’t afford to lose in a startup or SMB. When you separate the responsibilities of business development and sales within your organization, you’re grouping similar activities together and making individuals responsible for a limited set of goals that are directly impacted by the activities they’re expected to do on a daily basis (having a clear connection to impact being one of the three things that make work most meaningful). That elimination of multiple different types of goals allows members of your sales team to work on fewer tasks—thus empowering them to execute on single tasks for focused blocks of time. Which allows their calendars to look much more like… The fewer objectives your individual contributors (both in business development and sales roles) are responsible for delivering against, the more they’ll be able to focus on excelling and being more productive on the limited tasks at hand. Business development requires more effort than it used to The core functions of business development haven’t changed much in recent years, but the process of prospecting and qualifying leads has become much more nuanced. Business development roles are still charged with two main responsibilities: Prospecting: Identifying companies and people that may be interested in purchasing your product or service  Qualifying: Determining if your prospect is ready, willing and able to buy  Once a lead is qualified and has a strong likelihood of converting into becoming a paying customer, they’re passed off to the sales team for closing (and if need be negotiating the terms of the contract). This means that business development reps do not ideally have quotas. They’re responsible for bringing in enough qualified leads to generate a certain amount of revenue, but actually closing the sale and turning leads into customers is beyond their direct control. So, what’s changed in the world of business development? It’s become increasingly difficult to reach decision-makers and to engage them the way they want, when they want. Hell, I can’t even remember the last time I answered a call from a number I didn’t recognize—let alone respond to unsolicited sales emails. The proliferation of conversational sales and marketing tools like Drift are proof of this dramatic shift. Your customers time is valuable, and giving them the ability to control when and how they interact with you is a serious experience upgrade, therefore your sales plan needs to grow and adapt with this shift. Beyond just better managing the experience of your inbound leads, it also takes more time to adequately research prospects, and requires more touch points on a lead in order to capture their attention. Business development is more about relationship-building than ever, making it a standalone full-time position on any sales team. At the end of the day, it’s not a smart investment to have someone responsible for a new deal quota, shifting gears between prospecting, demoing and closing within their work day. How business development and sales work together (4 common questions) Now that we’re clear about the separation between business development vs sales, let’s talk about how the two roles should best work collaboratively together, for maximum effectiveness on your sales team. 1. When should business development pass a lead on to sales? Your sales team has quotas they need to hit, which means they can’t waste time talking to prospects that aren’t already well-qualified. Otherwise, they'll be wasting time and energy chasing the wrong leads and diluting their close rate. Business development reps should pass a lead on to sales as soon as they’re qualified . However, that doesn’t mean business development teams and sales teams shouldn’t have a collaborative work relationship. WeWork VP of Business Development, Scott Pollack explains, “business development teams should be identifying, evaluating, and pursuing opportunities to create long-term value for a company. This means BD teams and sales teams should happily coexist—the sales team gets to work on closing opportunities that can drive revenue today , while the BD team focuses their attention on opportunities to open new channels and drive a flood of new leads for tomorrow.” As Pollack suggests, it’s incredibly important that business development teams focus their time, effort and energy on building relationships only with the most qualified leads that stand a chance of becoming happy customers. Then, they’re worthy of being handed off to sales. How do you know when a lead is fully qualified and ready to be closed? That can vary a bit based on the type of product you’re selling and the market you’re serving, but starting with choosing from these 42 B2B qualifying questions to ask your prospects won’t hurt. In order to qualify your prospects, you’ll want to accurately gauge how well they match your ideal customer profile with key information around company size, location and industry. Next, you want to assess their needs to make sure there’s a true use case for your product, develop an understanding of their purchasing process to make sure it’s a match with your selling process, and assess other competitive options they may be considering. If everything checks out and the prospect still appears to be a strong potential customer, then they’re qualified—and ready to be closed by your sales team. 2. Should there be overlap between business development and sales? In terms of day-to-day activities? No, not really . Business development should be wholly tasked with prospecting and qualifying. Sales should be focused only on closing those qualified leads and generating transactions. However, your business development reps and sales reps do need to be on the same page about who your ideal customers are—their characteristics, qualities and the kinds of problems your offering can best help them with. Due to the rapidly changing environment in startups, this requires frequent cross-team collaboration. As CreativeLive Director of Partnerships and Business Development, Kimberly Pousman explains, “there not only should be overlap between business development and sales, but there needs to be overlap, whether you personally want it or not.” Pousman continues, “One of the keys to being great in either a business development or sales role, is asking the right questions. When you’re looking to grow and expand, you need to ask the right questions, experiment and actively source feedback from others—so if your teams are operating in a silo, they’ll miss out on valuable opportunities to learn from each other and advance your growth rate.” Furthermore, the downstream effect is that if this alignment between business development and sales teams isn’t up to par, your sales reps are going to have a difficult time closing enough deals with the leads they’ve got, which leads to frustration and a close rate below the 20-30% industry average for SaaS. If your sales team’s close rate is below 20%, they’re either not closing as well as they should, or your leads aren’t qualified enough. 3. What’s the difference in the day-to-day activities of business development reps and sales reps? While the responsibilities of a business development rep can vary a bit based on the unique needs and internal demands of an organization, in general they’re responsible for two main tasks that sit at the core of this role: Managing inbound leads: This translates into working through an internal list, qualifying leads from various marketing campaigns and classifying the right ones as sales opportunities to be passed on to the sales team for further vetting and closing.  Leading outbound prospecting: On the flip side, this kind of outreach involves researching and contacting potential customers that haven’t proactively expressed interest in your product through cold calls and cold emails—with the goal of qualifying sales opportunities for your sales team.  On the inbound side of things, business development reps sit metaphorically between marketing and sales, filtering marketing leads and qualifying them before assigning them to the right sales rep that can move on to close the sale . When it comes to outbound, business development reps need to first go through your organization’s sales training process so that they have a clear picture of who your ideal customers are before they go out and begin starting conversations with prospects. Depending upon the size of your company, your business development reps may or may not start with the beginning task of researching prospects before sending an email or calling. Ultimately though, the goal of any outbound business development work is to start a conversation and develop a relationship that can be passed on to sales for closing. Everything a business development rep does, should revolve around finding more prospects, qualifying the right ones and routing them to your sales team for closing. Now, let’s talk about the responsibilities of sales reps. Keeping in mind slight differences to match your unique internal needs, most sales representatives are charged with the following main responsibilities: Selling: Closing deals (ideally with pre-qualified leads from your business development team to save time) using solid arguments and objection management with prospective customers.  Maintaining relationships: Although a prospect might not be a fit to purchase your product or service today, that doesn’t mean they won’t be in a completely different position 6 months or a year from now—so keeping in touch with leads to encourage future sales is a major part of a sales rep’s responsibilities.  Most sales representative roles work against a sales quota —a thoughtfully calculated monthly or quarterly minimum for the number of customers (or revenue figure) they’re responsible to close. Sales reps are often incentivized with increasing levels of bonus payouts for hitting and exceeding quota within a given period. The intense focus on hitting specific customer or revenue benchmarks each quarter is very intentionally designed to encourage sales reps to spend all of their time only on revenue-driving activities. More meetings. More product demos. More sales calls with qualified leads. More contracts sent out for approval. More follow up emails delivered. In a mature sales organization, that means sales reps are empowered to spend less (or zero) time researching prospects, qualifying leads, and booking meetings. Those are activities a business development rep should be helping out with. 4. How does a business development call (or email) differ from that of a sales rep? The biggest difference between the calls and emails that business development reps send vs those of a sales rep, is that most business development activities are done toward either completely or relatively cold prospects—meaning that these prospects have likely had little to no interaction with the company before this initial contact is made. That’s when brushing up on your cold emails and cold calling skills come into play. By the time a sales rep is brought on to an account, the relationship has already been established and the lead is qualified, making the communications much more warm than those of a business development rep. The conversation with a sales rep is about how to make a mutually beneficial deal happen, rather than gauging the initial interest or need. Bonus: The key traits you need to look for in every business development (and sales) hire Bringing the right business development and salespeople onto your sales team is crucial in making meaningful progress toward growing your business. If your candidates don’t exhibit these key traits, our advice is to keep searching for the right people that will have a positive impact on your team. Communication and people skills If you hope to cultivate strong relationships with prospects and customers alike, having strong communication and people skills—like the ability to lead a friendly negotiation from start to finish so that the new customers you bring on are pleased with their decision, is crucial. Navigating the process of converting a lead into a paying customer requires the ability to empathize; to fully understand your prospect’s situation and the use case they’ll have for your product to make sure that they’ll truly benefit from your offering. Hunger and drive The most successful salespeople (and business development reps) have an internal drive that pushes them forward and propels them to achieve their sales goals. In the face of a challenge, they’re not discouraged—rather, they look forward to the opportunity to excel, surpass previous expectations and move up to the next level. They’re often incentivized by the prospect of earning more money , and respond well to financial rewards for performance improvements. Discipline and confidence Discipline and the confidence in your process beats motivation every single day of the week when you’ve just gotten ten rejections in a row. No matter how skilled or experience you are, in sales there will be moments of defeat that can drain your motivation levels. The best salespeople know that sales is a numbers game, and that the only way to recover from rejection & failure is to pick up the phone (or get back into your email) and keep executing. Having the right tools and systems, like our Power Dialer will also help keep your team on track and reaching peak productivity levels each day. They’re consultants at heart Just because a salesperson has mastered every tactic in the book and can sell ice to an eskimo doesn’t mean they’re going to bring in customers that’ll still be happy with their purchase decision one, three, six months down the line. When hiring a business development or sales rep, look for people that view their role as partnering with prospects to make sure there’s a mutual win-win in each potential deal—ensuring that the customer has a genuine need for the product and that they’re actually a fit for your ideal customer persona of people and companies you want to serve in the first place. Want to take your sales game to a new level? Get free access to our ultimate sales resource library today. ACCESS THE COMPLETE SALES LIBRARY NOW", "Fri Aug 02 21:45:12 UTC 2019", "Fri Aug 02 21:45:18 UTC 2019", "text/html", "en", "17", "blog.close.com", "https://blog.close.com/hubfs/Business%20Development%20vs%20Sales%20What%27s%20the%20Difference%20and%20Which%20Should%20You%20Hire%20First%20copy-1.jpg#keepProtocol", "200", "/api/entries/14012", "1641690266207256576"], "is_starred": 0, "user_name": "admin", "user_email": "rahul.singh@anant.us", "user_id": 1, "tags": ["sales.and.marketing", "sales"], "slugs": ["sales-and-marketing", "sales"], "is_public": false, "id": "14012", "title": "Business development vs sales: What’s the difference and which should you hire first?", "url": "https://blog.close.com/business-development-vs-sales", "content_text": "What’s the difference between business development and sales? Many founders we talk to believe the terms are interchangeable—simply two different ways to describe the same function… right? Not quite. Today, we’re talking business development vs sales . Let’s start by clearly defining both business development and sales . Then, we’ll dig deeper into the differences, how they support each other, and which function needs to be your focus based on the stage your company is at today. Want to take your sales game to a new level? Get free access to our ultimate sales resource library today. ACCESS THE COMPLETE SALES LIBRARY NOW What is business development? The definition of business development is generating qualified new leads. The purpose of business development (in the context of a sales team—NOT in terms of product validation) is to research, prospect and create a pipeline of targeted potential customers to pass off to sales for further vetting and closing. What is sales? The definition of sales is generating transactions. The sole focus of a mature sales team is to close deals with the qualified leads that are coming from either your business development efforts or other lead generation strategies that are designed to start conversations with the right potential customers. So… what’s the difference between business development and sales? Put simply, business development comes first. It’s the act of generating well-researched, qualified leads to hand off to your sales team. Business development is all about generating leads , and the job titles most often associated with business development are roles like, Business Development Rep (BDR) or Sales Development Rep (SDR). Sales comes second, and is wholly concerned with closing a winning deal with the qualified prospects that come from your organization’s business development activities. Sales is all about transactions. Titles for sales roles vary widely, but typically form around phrases like Sales Representative, Account Manager or Account Executive. Moreover, when you’re building a sales team from the ground up, it can be difficult to decide which role (business development vs sales) you should hire first—or to bring on more of in the early days. The answer, as with most things in business, is… well, it depends . Now that you’ve got a clear definition of the difference between business development and sales, start by first asking yourself which one sounds like a higher priority within your organization right now. Which role do you truly need today? If you’ve gotten clear market validation for your solution and are consistently closing a high proportion of the prospects you speak with, but just need a higher volume of leads to continue flowing through your pipeline, then hiring a business development rep and training them on how to prospect for the right leads should be your number one priority. If you have more qualified inbound leads than you know what to do with, but you simply don’t have enough time to follow up with every lead, schedule a meeting, do a demo and close the deal, then your focus should be on getting more sales reps on board who can help close more of your hot leads. Sounds pretty straightforward, but the reality is that it can take a while to get to this stage. In the earlier phases of your business (or before acquiring funding as a startup), it’s natural for founders and other members of the team to take on both business development and sales-related responsibilities while resources are constrained before sales hiring becomes a viable option. As long as the founder-driven sales stage is working well and your revenue is growing, that’s ok for a while. Over time though, the separation of the two roles should become more pronounced and specialized as your business begins to scale and you can afford to invest in better solving your bigger problem—generating more leads or bringing on salespeople to close more of the leads you already have. Why you need to separate business development and sales Let’s examine a few of the critical reasons why your business stands to benefit immensely by separating the roles of business development and sales. Creating domain expertise in your organization Since the advent of the world’s first automobile manufacturing lines in the early 1900’s, labor specialization has proliferated into countless other industries with massively positive effects. Division of labor: Known as the separation of tasks within any system, the primary goal of clearly dividing tasks within your sales team, is to allow individuals to specialize within their roles. Anyone who spends the majority of their day executing the same sets of tasks (that ladder up to a very clear goal) is likely going to build expertise much quicker than their counterparts who spend the day task-switching between multiple different roles and goals. Separating business development and sales within your organization is no exception. When you allow members of your sales team to focus solely on either prospecting or closing, they’ll develop a level of expertise at their role that’s otherwise very difficult to achieve. Instead of splitting their time (and mental capacity), or task-switching throughout their entire day, your business development reps are able to focus on doing everything they can to bring more qualified prospects into the company’s pipeline. Conversely, your sales reps are empowered to work on nothing but the key activities in your sales process that are proven to close more deals and generate transactions. Creating an environment that accelerates the development of expertise is priceless in terms of organizational benefits—you’ll be able to generate more leads and close more of them. Individual productivity gains We touched on this briefly in the context of rapidly building expertise within your sales organization as a result of separating business development and sales, but it’s worth highlighting the productivity gains your team will experience at the individual level too. When you have salespeople that are also doing their own prospecting (researching, qualifying, initial outreach), their calendars can quickly fill up with a myriad of different activities like conducting research, cold calling from a list of inbound leads and sending cold emails to prospects. Their calendars can quickly look like… Known as cognitive switching , the act of consciously switching from one task to another within your day can leave you mentally exhausted. On top of that, studies have shown the quality of your work declines dramatically the more frequently you switch between tasks. Psychologist David Meyer, PhD , director of the University of Michigan's Brain, Cognition, and Action Laboratory explains, “Although switching costs may be relatively small, sometimes just a few tenths of a second per switch, they can add up to large amounts when people switch repeatedly back and forth between tasks. Thus, multitasking may seem efficient on the surface, but may actually take more time in the end and involve more error.” Meyer reports that even brief mental blocks created by shifting between tasks can cost as much as 40% of someone's productive time in a given day—time that you can’t afford to lose in a startup or SMB. When you separate the responsibilities of business development and sales within your organization, you’re grouping similar activities together and making individuals responsible for a limited set of goals that are directly impacted by the activities they’re expected to do on a daily basis (having a clear connection to impact being one of the three things that make work most meaningful). That elimination of multiple different types of goals allows members of your sales team to work on fewer tasks—thus empowering them to execute on single tasks for focused blocks of time. Which allows their calendars to look much more like… The fewer objectives your individual contributors (both in business development and sales roles) are responsible for delivering against, the more they’ll be able to focus on excelling and being more productive on the limited tasks at hand. Business development requires more effort than it used to The core functions of business development haven’t changed much in recent years, but the process of prospecting and qualifying leads has become much more nuanced. Business development roles are still charged with two main responsibilities: Prospecting: Identifying companies and people that may be interested in purchasing your product or service  Qualifying: Determining if your prospect is ready, willing and able to buy  Once a lead is qualified and has a strong likelihood of converting into becoming a paying customer, they’re passed off to the sales team for closing (and if need be negotiating the terms of the contract). This means that business development reps do not ideally have quotas. They’re responsible for bringing in enough qualified leads to generate a certain amount of revenue, but actually closing the sale and turning leads into customers is beyond their direct control. So, what’s changed in the world of business development? It’s become increasingly difficult to reach decision-makers and to engage them the way they want, when they want. Hell, I can’t even remember the last time I answered a call from a number I didn’t recognize—let alone respond to unsolicited sales emails. The proliferation of conversational sales and marketing tools like Drift are proof of this dramatic shift. Your customers time is valuable, and giving them the ability to control when and how they interact with you is a serious experience upgrade, therefore your sales plan needs to grow and adapt with this shift. Beyond just better managing the experience of your inbound leads, it also takes more time to adequately research prospects, and requires more touch points on a lead in order to capture their attention. Business development is more about relationship-building than ever, making it a standalone full-time position on any sales team. At the end of the day, it’s not a smart investment to have someone responsible for a new deal quota, shifting gears between prospecting, demoing and closing within their work day. How business development and sales work together (4 common questions) Now that we’re clear about the separation between business development vs sales, let’s talk about how the two roles should best work collaboratively together, for maximum effectiveness on your sales team. 1. When should business development pass a lead on to sales? Your sales team has quotas they need to hit, which means they can’t waste time talking to prospects that aren’t already well-qualified. Otherwise, they'll be wasting time and energy chasing the wrong leads and diluting their close rate. Business development reps should pass a lead on to sales as soon as they’re qualified . However, that doesn’t mean business development teams and sales teams shouldn’t have a collaborative work relationship. WeWork VP of Business Development, Scott Pollack explains, “business development teams should be identifying, evaluating, and pursuing opportunities to create long-term value for a company. This means BD teams and sales teams should happily coexist—the sales team gets to work on closing opportunities that can drive revenue today , while the BD team focuses their attention on opportunities to open new channels and drive a flood of new leads for tomorrow.” As Pollack suggests, it’s incredibly important that business development teams focus their time, effort and energy on building relationships only with the most qualified leads that stand a chance of becoming happy customers. Then, they’re worthy of being handed off to sales. How do you know when a lead is fully qualified and ready to be closed? That can vary a bit based on the type of product you’re selling and the market you’re serving, but starting with choosing from these 42 B2B qualifying questions to ask your prospects won’t hurt. In order to qualify your prospects, you’ll want to accurately gauge how well they match your ideal customer profile with key information around company size, location and industry. Next, you want to assess their needs to make sure there’s a true use case for your product, develop an understanding of their purchasing process to make sure it’s a match with your selling process, and assess other competitive options they may be considering. If everything checks out and the prospect still appears to be a strong potential customer, then they’re qualified—and ready to be closed by your sales team. 2. Should there be overlap between business development and sales? In terms of day-to-day activities? No, not really . Business development should be wholly tasked with prospecting and qualifying. Sales should be focused only on closing those qualified leads and generating transactions. However, your business development reps and sales reps do need to be on the same page about who your ideal customers are—their characteristics, qualities and the kinds of problems your offering can best help them with. Due to the rapidly changing environment in startups, this requires frequent cross-team collaboration. As CreativeLive Director of Partnerships and Business Development, Kimberly Pousman explains, “there not only should be overlap between business development and sales, but there needs to be overlap, whether you personally want it or not.” Pousman continues, “One of the keys to being great in either a business development or sales role, is asking the right questions. When you’re looking to grow and expand, you need to ask the right questions, experiment and actively source feedback from others—so if your teams are operating in a silo, they’ll miss out on valuable opportunities to learn from each other and advance your growth rate.” Furthermore, the downstream effect is that if this alignment between business development and sales teams isn’t up to par, your sales reps are going to have a difficult time closing enough deals with the leads they’ve got, which leads to frustration and a close rate below the 20-30% industry average for SaaS. If your sales team’s close rate is below 20%, they’re either not closing as well as they should, or your leads aren’t qualified enough. 3. What’s the difference in the day-to-day activities of business development reps and sales reps? While the responsibilities of a business development rep can vary a bit based on the unique needs and internal demands of an organization, in general they’re responsible for two main tasks that sit at the core of this role: Managing inbound leads: This translates into working through an internal list, qualifying leads from various marketing campaigns and classifying the right ones as sales opportunities to be passed on to the sales team for further vetting and closing.  Leading outbound prospecting: On the flip side, this kind of outreach involves researching and contacting potential customers that haven’t proactively expressed interest in your product through cold calls and cold emails—with the goal of qualifying sales opportunities for your sales team.  On the inbound side of things, business development reps sit metaphorically between marketing and sales, filtering marketing leads and qualifying them before assigning them to the right sales rep that can move on to close the sale . When it comes to outbound, business development reps need to first go through your organization’s sales training process so that they have a clear picture of who your ideal customers are before they go out and begin starting conversations with prospects. Depending upon the size of your company, your business development reps may or may not start with the beginning task of researching prospects before sending an email or calling. Ultimately though, the goal of any outbound business development work is to start a conversation and develop a relationship that can be passed on to sales for closing. Everything a business development rep does, should revolve around finding more prospects, qualifying the right ones and routing them to your sales team for closing. Now, let’s talk about the responsibilities of sales reps. Keeping in mind slight differences to match your unique internal needs, most sales representatives are charged with the following main responsibilities: Selling: Closing deals (ideally with pre-qualified leads from your business development team to save time) using solid arguments and objection management with prospective customers.  Maintaining relationships: Although a prospect might not be a fit to purchase your product or service today, that doesn’t mean they won’t be in a completely different position 6 months or a year from now—so keeping in touch with leads to encourage future sales is a major part of a sales rep’s responsibilities.  Most sales representative roles work against a sales quota —a thoughtfully calculated monthly or quarterly minimum for the number of customers (or revenue figure) they’re responsible to close. Sales reps are often incentivized with increasing levels of bonus payouts for hitting and exceeding quota within a given period. The intense focus on hitting specific customer or revenue benchmarks each quarter is very intentionally designed to encourage sales reps to spend all of their time only on revenue-driving activities. More meetings. More product demos. More sales calls with qualified leads. More contracts sent out for approval. More follow up emails delivered. In a mature sales organization, that means sales reps are empowered to spend less (or zero) time researching prospects, qualifying leads, and booking meetings. Those are activities a business development rep should be helping out with. 4. How does a business development call (or email) differ from that of a sales rep? The biggest difference between the calls and emails that business development reps send vs those of a sales rep, is that most business development activities are done toward either completely or relatively cold prospects—meaning that these prospects have likely had little to no interaction with the company before this initial contact is made. That’s when brushing up on your cold emails and cold calling skills come into play. By the time a sales rep is brought on to an account, the relationship has already been established and the lead is qualified, making the communications much more warm than those of a business development rep. The conversation with a sales rep is about how to make a mutually beneficial deal happen, rather than gauging the initial interest or need. Bonus: The key traits you need to look for in every business development (and sales) hire Bringing the right business development and salespeople onto your sales team is crucial in making meaningful progress toward growing your business. If your candidates don’t exhibit these key traits, our advice is to keep searching for the right people that will have a positive impact on your team. Communication and people skills If you hope to cultivate strong relationships with prospects and customers alike, having strong communication and people skills—like the ability to lead a friendly negotiation from start to finish so that the new customers you bring on are pleased with their decision, is crucial. Navigating the process of converting a lead into a paying customer requires the ability to empathize; to fully understand your prospect’s situation and the use case they’ll have for your product to make sure that they’ll truly benefit from your offering. Hunger and drive The most successful salespeople (and business development reps) have an internal drive that pushes them forward and propels them to achieve their sales goals. In the face of a challenge, they’re not discouraged—rather, they look forward to the opportunity to excel, surpass previous expectations and move up to the next level. They’re often incentivized by the prospect of earning more money , and respond well to financial rewards for performance improvements. Discipline and confidence Discipline and the confidence in your process beats motivation every single day of the week when you’ve just gotten ten rejections in a row. No matter how skilled or experience you are, in sales there will be moments of defeat that can drain your motivation levels. The best salespeople know that sales is a numbers game, and that the only way to recover from rejection & failure is to pick up the phone (or get back into your email) and keep executing. Having the right tools and systems, like our Power Dialer will also help keep your team on track and reaching peak productivity levels each day. They’re consultants at heart Just because a salesperson has mastered every tactic in the book and can sell ice to an eskimo doesn’t mean they’re going to bring in customers that’ll still be happy with their purchase decision one, three, six months down the line. When hiring a business development or sales rep, look for people that view their role as partnering with prospects to make sure there’s a mutual win-win in each potential deal—ensuring that the customer has a genuine need for the product and that they’re actually a fit for your ideal customer persona of people and companies you want to serve in the first place. Want to take your sales game to a new level? Get free access to our ultimate sales resource library today. ACCESS THE COMPLETE SALES LIBRARY NOW", "created_at": "2019-08-02T21:45:12Z", "updated_at": "2019-08-02T21:45:18Z", "mimetype": "text/html", "language": "en", "reading_time": 17, "domain_name": "blog.close.com", "preview_picture": "https://blog.close.com/hubfs/Business%20Development%20vs%20Sales%20What%27s%20the%20Difference%20and%20Which%20Should%20You%20Hire%20First%20copy-1.jpg#keepProtocol", "http_status": 200, "_links": ["/api/entries/14012"], "content": "<img src=\"https://blog.close.com/hs-fs/hubfs/Business%20Development%20vs%20Sales%20What's%20the%20Difference%20and%20Which%20Should%20You%20Hire%20First%20copy-2.jpg?width=700&amp;name=Business%20Development%20vs%20Sales%20What's%20the%20Difference%20and%20Which%20Should%20You%20Hire%20First%20copy-2.jpg\" alt=\"business-development-vs-sales\" width=\"700\" srcset=\"https://blog.close.com/hs-fs/hubfs/Business%20Development%20vs%20Sales%20What's%20the%20Difference%20and%20Which%20Should%20You%20Hire%20First%20copy-2.jpg?width=350&amp;name=Business%20Development%20vs%20Sales%20What's%20the%20Difference%20and%20Which%20Should%20You%20Hire%20First%20copy-2.jpg 350w, https://blog.close.com/hs-fs/hubfs/Business%20Development%20vs%20Sales%20What's%20the%20Difference%20and%20Which%20Should%20You%20Hire%20First%20copy-2.jpg?width=700&amp;name=Business%20Development%20vs%20Sales%20What's%20the%20Difference%20and%20Which%20Should%20You%20Hire%20First%20copy-2.jpg 700w, https://blog.close.com/hs-fs/hubfs/Business%20Development%20vs%20Sales%20What's%20the%20Difference%20and%20Which%20Should%20You%20Hire%20First%20copy-2.jpg?width=1050&amp;name=Business%20Development%20vs%20Sales%20What's%20the%20Difference%20and%20Which%20Should%20You%20Hire%20First%20copy-2.jpg 1050w, https://blog.close.com/hs-fs/hubfs/Business%20Development%20vs%20Sales%20What's%20the%20Difference%20and%20Which%20Should%20You%20Hire%20First%20copy-2.jpg?width=1400&amp;name=Business%20Development%20vs%20Sales%20What's%20the%20Difference%20and%20Which%20Should%20You%20Hire%20First%20copy-2.jpg 1400w, https://blog.close.com/hs-fs/hubfs/Business%20Development%20vs%20Sales%20What's%20the%20Difference%20and%20Which%20Should%20You%20Hire%20First%20copy-2.jpg?width=1750&amp;name=Business%20Development%20vs%20Sales%20What's%20the%20Difference%20and%20Which%20Should%20You%20Hire%20First%20copy-2.jpg 1750w, https://blog.close.com/hs-fs/hubfs/Business%20Development%20vs%20Sales%20What's%20the%20Difference%20and%20Which%20Should%20You%20Hire%20First%20copy-2.jpg?width=2100&amp;name=Business%20Development%20vs%20Sales%20What's%20the%20Difference%20and%20Which%20Should%20You%20Hire%20First%20copy-2.jpg 2100w\" /><p>What’s the difference between business development and sales? Many founders we talk to believe the terms are interchangeable—simply two different ways to describe the same function… right? Not quite. Today, we’re talking <strong>business development vs sales</strong>.</p><p>Let’s start by clearly defining both <strong>business development and sales</strong>. Then, we’ll dig deeper into the differences, how they support each other, and which function needs to be your focus based on the stage your company is at today.</p><p><strong>Want to take your sales game to a new level? Get free access to our ultimate sales resource library today.</strong></p><p><a href=\"https://close.com/resources/startup-sales-resource-bundle/\" class=\"button small primary\" target=\"_blank\">ACCESS THE COMPLETE SALES LIBRARY NOW</a></p><h3><strong>What is business development?</strong></h3><p><strong>The definition of business development is generating qualified new leads.</strong> The purpose of business development (in the context of a sales team—NOT in terms of product validation) is to research, prospect and create a pipeline of targeted potential customers to pass off to sales for further vetting and closing.</p><h3><strong>What is sales?</strong></h3><p><strong>The definition of sales is generating transactions.</strong> The sole focus of a mature sales team is to close deals with the qualified leads that are coming from either your business development efforts or other <a href=\"https://blog.close.com/lead-generation\" rel=\"noopener\" target=\"_blank\">lead generation strategies</a> that are designed to start conversations with the right potential customers.</p><h3><strong>So… what’s the difference between business development and sales?</strong></h3><p>Put simply, business development comes first. It’s the act of generating well-researched, qualified leads to hand off to your sales team. <strong>Business development is all about generating leads</strong>, and the job titles most often associated with business development are roles like, Business Development Rep (BDR) or Sales Development Rep (SDR).</p><p>Sales comes second, and is wholly concerned with <a href=\"https://blog.close.com/close-sale\" rel=\"noopener\" target=\"_blank\">closing a winning deal</a> with the qualified prospects that come from your organization’s business development activities. <strong>Sales is all about transactions.</strong> Titles for sales roles vary widely, but typically form around phrases like Sales Representative, Account Manager or Account Executive. </p><p>Moreover, when you’re <a href=\"https://blog.close.com/sales-management-new-managers-guide-to-building-a-sales-team\" rel=\"noopener\" target=\"_blank\">building a sales team</a> from the ground up, it can be difficult to decide which role (business development vs sales) you should hire first—or to bring on more of in the early days.</p><p>The answer, as with most things in business, is… well, <em>it depends</em>.</p><p>Now that you’ve got a clear definition of the difference between business development and sales, start by first asking yourself which one sounds like a higher priority within your organization right now. Which role do you truly need today? </p><p>If you’ve gotten clear market validation for your solution and are consistently closing a high proportion of the prospects you speak with, but just need a higher volume of leads to continue flowing through your pipeline, then hiring a business development rep and training them on how to prospect for the right leads should be your number one priority.</p><p>If you have more qualified inbound leads than you know what to do with, but you simply don’t have enough time to follow up with every lead, schedule a meeting, do a demo and close the deal, then your focus should be on getting more sales reps on board who can help close more of your hot leads.</p><p>Sounds pretty straightforward, but the reality is that it can take a while to get to this stage.</p><p>In the earlier phases of your business (or before acquiring funding as a startup), it’s natural for founders and other members of the team to take on both business development and sales-related responsibilities while resources are constrained before <a href=\"https://blog.close.com/sales-hiring-101-for-startups\">sales hiring</a> becomes a viable option.</p><p>As long as the founder-driven sales stage is working well and your revenue is growing, that’s ok for a while. </p><p>Over time though, the separation of the two roles should become more pronounced and specialized as your business begins to scale and you can afford to invest in better solving your bigger problem—generating more leads or bringing on salespeople to close more of the leads you already have.</p><h2><strong>Why you need to separate business development and sales</strong></h2><p>Let’s examine a few of the critical reasons why your business stands to benefit immensely by separating the roles of business development and sales.</p><h3><strong>Creating domain expertise in your organization</strong></h3><p>Since the advent of the world’s first automobile manufacturing lines in the early 1900’s, <a href=\"https://www.investopedia.com/terms/s/specialization.asp\" rel=\"noopener\" target=\"_blank\">labor specialization</a> has proliferated into countless other industries with massively positive effects.</p><p><strong>Division of labor:</strong> Known as the separation of tasks within any system, the primary goal of clearly dividing tasks within your sales team, is to allow individuals to specialize within their roles.</p><p>Anyone who spends the majority of their day executing the same sets of tasks (that ladder up to a very clear goal) is likely going to build expertise much quicker than their counterparts who spend the day task-switching between multiple different roles and goals. </p><p>Separating business development and sales within your organization is no exception. When you allow members of your sales team to focus solely on either prospecting or closing, they’ll develop a level of expertise at their role that’s otherwise very difficult to achieve.</p><p>Instead of splitting their time (and mental capacity), or task-switching throughout their entire day, your business development reps are able to focus on doing everything they can to bring more qualified prospects into the company’s pipeline. Conversely, your sales reps are empowered to work on nothing but the key activities in <a href=\"https://blog.close.com/how-to-build-a-sales-process-that-gets-results\" rel=\"noopener\" target=\"_blank\">your sales process</a> that are proven to close more deals and generate transactions. </p><p>Creating an environment that accelerates the development of expertise is priceless in terms of organizational benefits—you’ll be able to generate more leads <em>and</em> close more of them.</p><h3><strong>Individual productivity gains</strong></h3><p>We touched on this briefly in the context of rapidly building expertise within your sales organization as a result of separating business development and sales, but it’s worth highlighting the productivity gains your team will experience at the individual level too.</p><p>When you have salespeople that are also doing their own prospecting (researching, qualifying, initial outreach), their calendars can quickly fill up with a myriad of different activities like conducting research, <a href=\"https://blog.close.com/b2b-cold-calling-tips\" rel=\"noopener\" target=\"_blank\">cold calling</a> from a list of inbound leads and <a href=\"https://blog.close.com/5-cold-email-templates-that-will-generate-warm-leads-for-your-sales-team\" rel=\"noopener\" target=\"_blank\">sending cold emails</a> to prospects. Their calendars can quickly look like…</p><p><img src=\"https://blog.close.com/hs-fs/hubfs/Business%20development%20vs%20sales%20task%20switching%20costs-1.jpg?width=800&amp;name=Business%20development%20vs%20sales%20task%20switching%20costs-1.jpg\" alt=\"sales-cognitive-switching\" width=\"800\" srcset=\"https://blog.close.com/hs-fs/hubfs/Business%20development%20vs%20sales%20task%20switching%20costs-1.jpg?width=400&amp;name=Business%20development%20vs%20sales%20task%20switching%20costs-1.jpg 400w, https://blog.close.com/hs-fs/hubfs/Business%20development%20vs%20sales%20task%20switching%20costs-1.jpg?width=800&amp;name=Business%20development%20vs%20sales%20task%20switching%20costs-1.jpg 800w, https://blog.close.com/hs-fs/hubfs/Business%20development%20vs%20sales%20task%20switching%20costs-1.jpg?width=1200&amp;name=Business%20development%20vs%20sales%20task%20switching%20costs-1.jpg 1200w, https://blog.close.com/hs-fs/hubfs/Business%20development%20vs%20sales%20task%20switching%20costs-1.jpg?width=1600&amp;name=Business%20development%20vs%20sales%20task%20switching%20costs-1.jpg 1600w, https://blog.close.com/hs-fs/hubfs/Business%20development%20vs%20sales%20task%20switching%20costs-1.jpg?width=2000&amp;name=Business%20development%20vs%20sales%20task%20switching%20costs-1.jpg 2000w, https://blog.close.com/hs-fs/hubfs/Business%20development%20vs%20sales%20task%20switching%20costs-1.jpg?width=2400&amp;name=Business%20development%20vs%20sales%20task%20switching%20costs-1.jpg 2400w\" /></p><p>Known as <a href=\"https://en.wikipedia.org/wiki/Cognitive_shifting\" rel=\"noopener\" target=\"_blank\">cognitive switching</a>, the act of consciously switching from one task to another within your day can leave you mentally exhausted. On top of that, studies <a href=\"http://www.apa.org/research/action/multitask.aspx\" rel=\"noopener\" target=\"_blank\">have shown</a> the quality of your work declines dramatically the more frequently you switch between tasks.</p><p>Psychologist <a href=\"https://lsa.umich.edu/psych/people/faculty/demeyer.html\" rel=\"noopener\" target=\"_blank\">David Meyer, PhD</a>, director of the University of Michigan's Brain, Cognition, and Action Laboratory explains, “Although switching costs may be relatively small, sometimes just a few tenths of a second per switch, they can add up to large amounts when people switch repeatedly back and forth between tasks. Thus, multitasking may seem efficient on the surface, but may actually take more time in the end and involve more error.” </p><p>Meyer reports that even brief mental blocks created by shifting between tasks <strong>can cost as much as 40%</strong> of someone's productive time in a given day—time that you can’t afford to lose in a startup or SMB.</p><p>When you separate the responsibilities of business development and sales within your organization, you’re grouping similar activities together and making individuals responsible for a limited set of goals that are directly impacted by the activities they’re expected to do on a daily basis (having a clear connection to impact being <a href=\"https://open.buffer.com/meaningful-work/\" rel=\"noopener\" target=\"_blank\">one of the three things</a> that make work most meaningful).</p><p>That elimination of multiple different types of goals allows members of your sales team to work on fewer tasks—thus empowering them to execute on single tasks for focused blocks of time. Which allows their calendars to look much more like…  </p><p><img src=\"https://blog.close.com/hs-fs/hubfs/Business%20development%20vs%20sales%20dream%20calendar%20for%20business%20dev%20rep.jpg?width=1000&amp;name=Business%20development%20vs%20sales%20dream%20calendar%20for%20business%20dev%20rep.jpg\" alt=\"dream-calendar-for-business-dev-rep\" width=\"1000\" srcset=\"https://blog.close.com/hs-fs/hubfs/Business%20development%20vs%20sales%20dream%20calendar%20for%20business%20dev%20rep.jpg?width=500&amp;name=Business%20development%20vs%20sales%20dream%20calendar%20for%20business%20dev%20rep.jpg 500w, https://blog.close.com/hs-fs/hubfs/Business%20development%20vs%20sales%20dream%20calendar%20for%20business%20dev%20rep.jpg?width=1000&amp;name=Business%20development%20vs%20sales%20dream%20calendar%20for%20business%20dev%20rep.jpg 1000w, https://blog.close.com/hs-fs/hubfs/Business%20development%20vs%20sales%20dream%20calendar%20for%20business%20dev%20rep.jpg?width=1500&amp;name=Business%20development%20vs%20sales%20dream%20calendar%20for%20business%20dev%20rep.jpg 1500w, https://blog.close.com/hs-fs/hubfs/Business%20development%20vs%20sales%20dream%20calendar%20for%20business%20dev%20rep.jpg?width=2000&amp;name=Business%20development%20vs%20sales%20dream%20calendar%20for%20business%20dev%20rep.jpg 2000w, https://blog.close.com/hs-fs/hubfs/Business%20development%20vs%20sales%20dream%20calendar%20for%20business%20dev%20rep.jpg?width=2500&amp;name=Business%20development%20vs%20sales%20dream%20calendar%20for%20business%20dev%20rep.jpg 2500w, https://blog.close.com/hs-fs/hubfs/Business%20development%20vs%20sales%20dream%20calendar%20for%20business%20dev%20rep.jpg?width=3000&amp;name=Business%20development%20vs%20sales%20dream%20calendar%20for%20business%20dev%20rep.jpg 3000w\" /></p><p>The fewer objectives your individual contributors (both in business development and sales roles) are responsible for delivering against, the more they’ll be able to focus on excelling and being more productive on the limited tasks at hand.</p><h3><strong>Business development requires more effort than it used to</strong></h3><p>The core functions of business development haven’t changed much in recent years, but the process of prospecting and qualifying leads<em> has</em> become much more nuanced.   </p><p>Business development roles are still charged with two main responsibilities:</p><ul><li><strong>Prospecting:</strong> Identifying companies and people that may be interested in purchasing your product or service</li>\n<li><strong>Qualifying:</strong> Determining if your prospect is ready, willing and able to buy </li>\n</ul><p>Once a lead is qualified and has a strong likelihood of converting into becoming a paying customer, they’re passed off to the sales team for closing (and if need be <a href=\"https://blog.close.com/negotiate\" rel=\"noopener\" target=\"_blank\">negotiating</a> the terms of the contract).</p><p>This means that business development reps do not <em>ideally</em> have quotas. They’re responsible for bringing in enough qualified leads to generate a certain amount of revenue, but actually <a href=\"https://blog.close.com/close-sale\" rel=\"noopener\" target=\"_blank\">closing the sale</a> and turning leads into customers is beyond their direct control.</p><p><strong>So, what’s changed in the world of business development?</strong></p><p>It’s become increasingly difficult to reach decision-makers and to engage them the way they want, when they want. Hell, I can’t even remember the last time I answered a call from a number I didn’t recognize—let alone respond to unsolicited sales emails. </p><p>The proliferation of conversational sales and marketing tools like <a href=\"https://www.drift.com/\" rel=\"noopener\" target=\"_blank\">Drift</a> are proof of this dramatic shift. Your customers time is valuable, and giving them the ability to control when and how they interact with you is a serious experience upgrade, therefore your <a href=\"https://blog.close.com/create-sales-plan\" rel=\"noopener\" target=\"_blank\">sales plan</a> needs to grow and adapt with this shift. </p><p>Beyond just better managing the experience of your inbound leads, it also takes more time to adequately research prospects, and requires more touch points on a lead in order to capture their attention.</p><p>Business development is more about relationship-building than ever, making it a standalone full-time position on any sales team.</p><p>At the end of the day, it’s not a smart investment to have someone responsible for a new deal quota, shifting gears between prospecting, demoing and closing within their work day.</p><h2><strong>How business development and sales work together (4 common questions)</strong></h2><p>Now that we’re clear about the separation between business development vs sales, let’s talk about how the two roles should best work collaboratively together, for maximum effectiveness on your sales team.</p><h3><strong>1. When should business development pass a lead on to sales?</strong></h3><p>Your sales team has quotas they need to hit, which means they can’t waste time talking to prospects that aren’t already <a href=\"https://blog.close.com/qualify\" rel=\"noopener\" target=\"_blank\">well-qualified.</a> Otherwise, they'll be wasting time and energy chasing the wrong leads and diluting their close rate.</p><p>Business development reps should pass a lead on to sales <strong>as soon as they’re qualified</strong>. However, that doesn’t mean business development teams and sales teams shouldn’t have a collaborative work relationship.</p><p><a href=\"https://www.wework.com/\" rel=\"noopener\" target=\"_blank\">WeWork</a> VP of Business Development, <a href=\"http://startofthedeal.com/\" rel=\"noopener\" target=\"_blank\">Scott Pollack</a> explains, “business development teams should be identifying, evaluating, and pursuing opportunities to create long-term value for a company. This means BD teams and sales teams should happily coexist—the sales team gets to work on closing opportunities that can drive revenue <em>today</em>, while the BD team focuses their attention on opportunities to open new channels and drive a flood of new leads for tomorrow.”</p><p>As Pollack suggests, it’s incredibly important that business development teams focus their time, effort and energy on building relationships only with the most qualified leads that stand a chance of becoming happy customers. Then, they’re worthy of being handed off to sales.</p><p>How do you know when a lead is fully qualified and ready to be closed? That can vary a bit based on the type of product you’re selling and the market you’re serving, but starting with choosing from these <a href=\"https://resources.close.com/qualifying-questions\" rel=\"noopener\" target=\"_blank\">42 B2B qualifying questions</a> to ask your prospects won’t hurt. </p><p>In order to qualify your prospects, you’ll want to accurately gauge how well they match your <a href=\"https://sixteenventures.com/ideal-customer-profile\" rel=\"noopener\" target=\"_blank\">ideal customer profile</a> with key information around company size, location and industry. </p><p>Next, you want to assess their needs to make sure there’s a true use case for your product, develop an understanding of their purchasing process to make sure it’s a match with your selling process, and assess other competitive options they may be considering.</p><p>If everything checks out and the prospect still appears to be a strong potential customer, then they’re qualified—and ready to be closed by your sales team.</p><h3><strong>2. Should there be overlap between business development and sales?</strong></h3><p>In terms of day-to-day activities? <strong>No, not really</strong>.</p><p>Business development should be wholly tasked with prospecting and qualifying. Sales should be focused only on closing those qualified leads and generating transactions.</p><p>However, your business development reps and sales reps <em>do</em> need to be on the same page about who your ideal customers are—their characteristics, qualities and the kinds of problems your offering can best help them with.</p><p>Due to the rapidly changing environment in startups, this requires frequent cross-team collaboration.</p><p>As <a href=\"https://www.creativelive.com/\" rel=\"noopener\" target=\"_blank\">CreativeLive</a> Director of Partnerships and Business Development, <a href=\"https://www.linkedin.com/in/kimberlyannmurphy/\" rel=\"noopener\" target=\"_blank\">Kimberly Pousman</a> explains, “there not only <em>should be</em> overlap between business development and sales, but there <em>needs to be</em> overlap, whether you personally want it or not.” </p><p>Pousman continues, “One of the keys to being great in either a business development or sales role, is asking the right questions. When you’re looking to grow and expand, you need to ask the right questions, experiment and actively source feedback from others—so if your teams are operating in a silo, they’ll miss out on valuable opportunities to learn from each other and advance your growth rate.”</p><p>Furthermore, the downstream effect is that if this alignment between business development and sales teams isn’t up to par, your sales reps are going to have a difficult time closing enough deals with the leads they’ve got, which leads to frustration and a close rate below the <a href=\"https://www.pointclear.com/blog/what-should-the-sales-close-rate-be\" rel=\"noopener\" target=\"_blank\">20-30% industry average</a> for SaaS.</p><p>If your sales team’s close rate is below 20%, they’re either not closing as well as they should, or your leads aren’t qualified enough.</p><h3><strong>3. What’s the difference in the day-to-day activities of business development reps and sales reps?</strong></h3><p>While the responsibilities of a business development rep can vary a bit based on the unique needs and internal demands of an organization, in general they’re responsible for two main tasks that sit at the core of this role:</p><ul><li><strong>Managing inbound leads:</strong> This translates into working through an internal list, <a href=\"https://blog.close.com/qualify\" rel=\"noopener\" target=\"_blank\">qualifying leads</a> from various marketing campaigns and classifying the right ones as sales opportunities to be passed on to the sales team for further vetting and closing.</li>\n<li><strong>Leading outbound prospecting:</strong> On the flip side, this kind of outreach involves researching and contacting potential customers that haven’t proactively expressed interest in your product through cold calls and cold emails—with the goal of qualifying sales opportunities for your sales team. </li>\n</ul><p>On the inbound side of things, business development reps sit metaphorically between marketing and sales, filtering marketing leads and qualifying them before assigning them to the right sales rep that can move on to <a href=\"https://blog.close.com/close-sale\" rel=\"noopener\" target=\"_blank\">close the sale</a>.</p><p>When it comes to outbound, business development reps need to first go through your organization’s <a href=\"https://blog.close.com/unstoppable-sales-team\" rel=\"noopener\" target=\"_blank\">sales training</a> process so that they have a clear picture of who your ideal customers are before they go out and begin starting conversations with prospects. Depending upon the size of your company, your business development reps may or may not start with the beginning task of researching prospects before sending an email or calling.</p><p>Ultimately though, the goal of any outbound business development work is to start a conversation and <a href=\"https://www.forbes.com/sites/samanthaharrington/2017/05/26/how-to-create-strong-sales-relationships/\" rel=\"noopener\" target=\"_blank\">develop a relationship</a> that can be passed on to sales for closing. Everything a business development rep does, should revolve around finding more prospects, qualifying the right ones and routing them to your sales team for closing.</p><p><strong>Now, let’s talk about the responsibilities of sales reps.</strong></p><p>Keeping in mind slight differences to match your unique internal needs, most sales representatives are charged with the following main responsibilities:</p><ul><li><strong>Selling:</strong> Closing deals (ideally with pre-qualified leads from your business development team to save time) using solid arguments and <a href=\"https://blog.close.com/10-objection-handling-techniques-every-b2b-salesperson-should-know\" rel=\"noopener\" target=\"_blank\">objection management</a> with prospective customers.</li>\n<li><strong>Maintaining relationships:</strong> Although a prospect might not be a fit to purchase your product or service today, that doesn’t mean they won’t be in a completely different position 6 months or a year from now—so keeping in touch with leads to encourage future sales is a major part of a sales rep’s responsibilities.</li>\n</ul><p>Most sales representative roles work against a <a href=\"https://blog.close.com/end-of-year-sales\" rel=\"noopener\" target=\"_blank\">sales quota</a>—a thoughtfully calculated monthly or quarterly minimum for the number of customers (or revenue figure) they’re responsible to close. Sales reps are often incentivized with increasing levels of bonus payouts for hitting and exceeding quota within a given period.</p><p>The intense focus on hitting specific customer or revenue benchmarks each quarter is very intentionally designed to encourage sales reps to spend all of their time only on revenue-driving activities. More meetings. More product demos. More sales calls with qualified leads. More contracts sent out for approval. More <a href=\"https://blog.close.com/follow-up\" rel=\"noopener\" target=\"_blank\">follow up emails</a> delivered.</p><p>In a mature sales organization, that means sales reps are empowered to spend less (or zero) time researching prospects, qualifying leads, and booking meetings. Those are activities a business development rep should be helping out with.</p><h3><strong>4. How does a business development call (or email) differ from that of a sales rep?</strong></h3><p>The biggest difference between the calls and emails that business development reps send vs those of a sales rep, is that most business development activities are done toward either completely or relatively <em>cold</em> prospects—meaning that these prospects have likely had little to no interaction with the company before this initial contact is made. </p><p>That’s when brushing up on your <a href=\"https://blog.close.com/5-cold-email-templates-that-will-generate-warm-leads-for-your-sales-team\" rel=\"noopener\" target=\"_blank\">cold emails</a> and <a href=\"https://blog.close.com/b2b-cold-calling-tips\" rel=\"noopener\" target=\"_blank\">cold calling</a> skills come into play.</p><p>By the time a sales rep is brought on to an account, the relationship has already been established and the lead is qualified, making the communications much more <em>warm</em> than those of a business development rep. The conversation with a sales rep is about how to make a mutually beneficial deal happen, rather than gauging the initial interest or need.</p><h2><strong>Bonus: The key traits you need to look for in every business development (and sales) hire</strong></h2><p>Bringing the right business development and salespeople onto your sales team is crucial in making meaningful progress toward growing your business. If your candidates don’t exhibit these key traits, our advice is to keep searching for the right people that <em>will</em> have a positive impact on your team.</p><h3><strong>Communication and people skills</strong></h3><p>If you hope to cultivate strong relationships with prospects and customers alike, having strong communication and people skills—like the ability to lead a friendly <a href=\"https://blog.close.com/negotiate\" rel=\"noopener\" target=\"_blank\">negotiation</a> from start to finish so that the new customers you bring on are pleased with their decision, is crucial.</p><p>Navigating the process of converting a lead into a paying customer requires the ability to empathize; to fully understand your prospect’s situation and the use case they’ll have for your product to make sure that they’ll truly benefit from your offering.</p><h3><strong>Hunger and drive</strong></h3><p>The most successful salespeople (and business development reps) have an internal drive that pushes them forward and propels them to achieve their sales goals.</p><p> In the face of a challenge, they’re not discouraged—rather, they look forward to the opportunity to excel, surpass previous expectations and move up to the next level. They’re often incentivized by the prospect of <a href=\"https://www.ryrob.com/make-money-online/\" rel=\"noopener\" target=\"_blank\">earning more money</a>, and respond well to financial rewards for performance improvements.</p><h3><strong>Discipline and confidence</strong></h3><p>Discipline and the confidence in your process beats motivation every single day of the week when you’ve just gotten ten rejections in a row. No matter how skilled or experience you are, in sales there will be moments of defeat that can drain your motivation levels.</p><p>The best salespeople know that sales is a numbers game, and that the only way to recover from rejection &amp; failure is to pick up the phone (or get back into your email) and keep executing. Having the right tools and systems, like our <a href=\"https://close.com/calling/automation/power-dialer/\" rel=\"noopener\" target=\"_blank\">Power Dialer</a> will also help keep your team on track and reaching peak productivity levels each day.</p><h3><strong>They’re consultants at heart</strong></h3><p>Just because a salesperson has mastered every tactic in the book and can sell ice to an eskimo doesn’t mean they’re going to bring in customers that’ll <em>still be happy</em> with their purchase decision one, three, six months down the line.</p><p>When hiring a business development or sales rep, look for people that view their role as partnering with prospects to make sure there’s a mutual win-win in each potential deal—ensuring that the customer has a genuine need for the product and that they’re actually a fit for your ideal customer persona of people and companies you want to serve in the first place.</p><p><strong>Want to take your sales game to a new level? Get free access to our ultimate sales resource library today.</strong></p><p><a href=\"https://close.com/resources/startup-sales-resource-bundle/\" class=\"button small primary\" target=\"_blank\">ACCESS THE COMPLETE SALES LIBRARY NOW</a></p>"}, {"is_archived": 1, "all": ["1", "0", "admin", "rahul.singh@anant.us", "1", "linux", "linux", "0", "14013", "9 commands to check hard disk partitions and disk space on Linux", "https://www.binarytides.com/linux-command-check-disk-partitions/", "<div id=\"post_start\">\n<p>In this post we are taking a look at some commands that can be used to check up the partitions on your system. The commands would check what partitions there are on each disk and other details like the total size, used up space and file system etc.</p>\n<pre class=\"adflexi\">\n\n\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-5814774904969415\" data-ad-slot=\"0700059493\">\n\n\n</ins></pre></div>\n\n\n\n\n\n<p>Commands like fdisk, sfdisk and cfdisk are general partitioning tools that can not only display the partition information, but also modify them.</p>\n<h3>1. fdisk</h3>\n<p>Fdisk is the most commonly used command to check the partitions on a disk. The fdisk command can display the partitions and details like file system type. However it does not report the size of each partitions.</p>\n<pre class=\"terminal\">$ sudo fdisk -l&#13;\n&#13;\nDisk /dev/sda: 500.1 GB, 500107862016 bytes&#13;\n255 heads, 63 sectors/track, 60801 cylinders, total 976773168 sectors&#13;\nUnits = sectors of 1 * 512 = 512 bytes&#13;\nSector size (logical/physical): 512 bytes / 512 bytes&#13;\nI/O size (minimum/optimal): 512 bytes / 512 bytes&#13;\nDisk identifier: 0x30093008&#13;\n&#13;\n   Device Boot      Start         End      Blocks   Id  System&#13;\n/dev/sda1   *          63   146801969    73400953+   7  HPFS/NTFS/exFAT&#13;\n/dev/sda2       146802031   976771071   414984520+   f  W95 Ext'd (LBA)&#13;\n/dev/sda5       146802033   351614654   102406311    7  HPFS/NTFS/exFAT&#13;\n/dev/sda6       351614718   556427339   102406311   83  Linux&#13;\n/dev/sda7       556429312   560427007     1998848   82  Linux swap / Solaris&#13;\n/dev/sda8       560429056   976771071   208171008   83  Linux&#13;\n&#13;\nDisk /dev/sdb: 4048 MB, 4048551936 bytes&#13;\n54 heads, 9 sectors/track, 16270 cylinders, total 7907328 sectors&#13;\nUnits = sectors of 1 * 512 = 512 bytes&#13;\nSector size (logical/physical): 512 bytes / 512 bytes&#13;\nI/O size (minimum/optimal): 512 bytes / 512 bytes&#13;\nDisk identifier: 0x0001135d&#13;\n&#13;\n   Device Boot      Start         End      Blocks   Id  System&#13;\n/dev/sdb1   *        2048     7907327     3952640    b  W95 FAT32</pre>\n<p>Each device is reported separately with details about size, seconds, id and individual partitions.</p>\n<h3>2. sfdisk</h3>\n<p>Sfdisk is another utility with a purpose similar to fdisk, but with more features. It can display the size of each partition in MB.</p>\n<pre class=\"terminal\">$ sudo sfdisk -l -uM&#13;\n&#13;\nDisk /dev/sda: 60801 cylinders, 255 heads, 63 sectors/track&#13;\nWarning: extended partition does not start at a cylinder boundary.&#13;\nDOS and Linux will interpret the contents differently.&#13;\nUnits = mebibytes of 1048576 bytes, blocks of 1024 bytes, counting from 0&#13;\n&#13;\n   Device Boot Start   End    MiB    #blocks   Id  System&#13;\n/dev/sda1   *     0+ 71680- 71681-  73400953+   7  HPFS/NTFS/exFAT&#13;\n/dev/sda2     71680+ 476938  405259- 414984520+   f  W95 Ext'd (LBA)&#13;\n/dev/sda3         0      -      0          0    0  Empty&#13;\n/dev/sda4         0      -      0          0    0  Empty&#13;\n/dev/sda5     71680+ 171686- 100007- 102406311    7  HPFS/NTFS/exFAT&#13;\n/dev/sda6     171686+ 271693- 100007- 102406311   83  Linux&#13;\n/dev/sda7     271694  273645   1952    1998848   82  Linux swap / Solaris&#13;\n/dev/sda8     273647  476938  203292  208171008   83  Linux&#13;\n&#13;\nDisk /dev/sdb: 1020 cylinders, 125 heads, 62 sectors/track&#13;\nWarning: The partition table looks like it was made&#13;\n  for C/H/S=*/54/9 (instead of 1020/125/62).&#13;\nFor this listing I'll assume that geometry.&#13;\nUnits = mebibytes of 1048576 bytes, blocks of 1024 bytes, counting from 0&#13;\n&#13;\n   Device Boot Start   End    MiB    #blocks   Id  System&#13;\n/dev/sdb1   *     1   3860   3860    3952640    b  W95 FAT32&#13;\n                start: (c,h,s) expected (4,11,6) found (0,32,33)&#13;\n                end: (c,h,s) expected (1023,53,9) found (492,53,9)&#13;\n/dev/sdb2         0      -      0          0    0  Empty&#13;\n/dev/sdb3         0      -      0          0    0  Empty&#13;\n/dev/sdb4         0      -      0          0    0  Empty</pre><pre class=\"adwrap\">\n\n\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-5814774904969415\" data-ad-slot=\"7125586293\">\n\n\n</ins></pre>\n\n\n<h3>3. cfdisk</h3>\n<p>Cfdisk is a linux partition editor with an interactive user interface based on ncurses. It can be used to list out the existing partitions as well as create or modify them. </p>\n<p>Here is an example of how to use cfdisk to list the partitions.</p>\n<p><img src=\"https://www.binarytides.com/blog/wp-content/uploads/2014/06/linux-cfdisk.png\" alt=\"linux cfdisk disk partitions\" width=\"640\" height=\"480\" class=\"alignnone size-full wp-image-7267\" srcset=\"https://www.binarytides.com/blog/wp-content/uploads/2014/06/linux-cfdisk.png 640w, https://www.binarytides.com/blog/wp-content/uploads/2014/06/linux-cfdisk-300x225.png 300w, https://www.binarytides.com/blog/wp-content/uploads/2014/06/linux-cfdisk-600x450.png 600w\" /></p>\n<p>Cfdisk works with one partition at a time. So if you need to see the details of a particular disk, then pass the device name to cfdisk.</p>\n<pre class=\"terminal\">$ sudo cfdisk /dev/sdb</pre>\n<h3>4. parted</h3>\n<p>Parted is yet another command line utility to list out partitions and modify them if needed.<br />\nHere is an example that lists out the partition details.</p>\n<pre class=\"terminal\">$ sudo parted -l&#13;\nModel: ATA ST3500418AS (scsi)&#13;\nDisk /dev/sda: 500GB&#13;\nSector size (logical/physical): 512B/512B&#13;\nPartition Table: msdos&#13;\n&#13;\nNumber  Start   End     Size    Type      File system     Flags&#13;\n 1      32.3kB  75.2GB  75.2GB  primary   ntfs            boot&#13;\n 2      75.2GB  500GB   425GB   extended                  lba&#13;\n 5      75.2GB  180GB   105GB   logical   ntfs&#13;\n 6      180GB   285GB   105GB   logical   ext4&#13;\n 7      285GB   287GB   2047MB  logical   linux-swap(v1)&#13;\n 8      287GB   500GB   213GB   logical   ext4&#13;\n&#13;\n&#13;\nModel: Sony Storage Media (scsi)&#13;\nDisk /dev/sdb: 4049MB&#13;\nSector size (logical/physical): 512B/512B&#13;\nPartition Table: msdos&#13;\n&#13;\nNumber  Start   End     Size    Type     File system  Flags&#13;\n 1      1049kB  4049MB  4048MB  primary  fat32        boot</pre>\n<h3>5. df</h3>\n<p>Df is not a partitioning utility, but prints out details about only mounted file systems. The list generated by df even includes file systems that are not real disk partitions.</p>\n<p>Here is a simple example</p>\n<pre class=\"terminal\">$ df -h&#13;\nFilesystem      Size  Used Avail Use% Mounted on&#13;\n/dev/sda6        97G   43G   49G  48% /&#13;\nnone            4.0K     0  4.0K   0% /sys/fs/cgroup&#13;\nudev            3.9G  8.0K  3.9G   1% /dev&#13;\ntmpfs           799M  1.7M  797M   1% /run&#13;\nnone            5.0M     0  5.0M   0% /run/lock&#13;\nnone            3.9G   12M  3.9G   1% /run/shm&#13;\nnone            100M   20K  100M   1% /run/user&#13;\n/dev/sda8       196G  154G   33G  83% /media/13f35f59-f023-4d98-b06f-9dfaebefd6c1&#13;\n/dev/sda5        98G   37G   62G  38% /media/4668484A68483B47</pre>\n<p>Only the file systems that start with a /dev are actual devices or partitions.<br />\nUse grep to filter out real hard disk partitions/file systems.</p>\n<pre class=\"terminal\">$ df -h | grep ^/dev&#13;\n/dev/sda6        97G   43G   49G  48% /&#13;\n/dev/sda8       196G  154G   33G  83% /media/13f35f59-f023-4d98-b06f-9dfaebefd6c1&#13;\n/dev/sda5        98G   37G   62G  38% /media/4668484A68483B47</pre>\n<p>To display only real disk partitions along with partition type, use df like this</p>\n<pre class=\"terminal\">$ df -h --output=source,fstype,size,used,avail,pcent,target -x tmpfs -x devtmpfs&#13;\nFilesystem     Type     Size  Used Avail Use% Mounted on&#13;\n/dev/sda6      ext4      97G   43G   49G  48% /&#13;\n/dev/sda8      ext4     196G  154G   33G  83% /media/13f35f59-f023-4d98-b06f-9dfaebefd6c1&#13;\n/dev/sda5      fuseblk   98G   37G   62G  38% /media/4668484A68483B47</pre>\n<p>Note that df shows only the mounted file systems or partitions and not all.</p>\n<h3>6. pydf</h3>\n<p>Improved version of df, written in python. Prints out all the hard disk partitions in a easy to read manner.</p>\n<pre class=\"terminal\">$ pydf&#13;\nFilesystem Size Used Avail Use%             Mounted on                                 &#13;\n/dev/sda6   96G  43G   48G 44.7 [####.....] /                                          &#13;\n/dev/sda8  195G 153G   32G 78.4 [#######..] /media/13f35f59-f023-4d98-b06f-9dfaebefd6c1&#13;\n/dev/sda5   98G  36G   61G 37.1 [###......] /media/4668484A68483B47</pre>\n<p>Again, pydf is limited to showing only the mounted file systems.</p>\n<h3>7. lsblk</h3>\n<p>Lists out all the storage blocks, which includes disk partitions and optical drives. Details include the total size of the partition/block and the mount point if any.<br />\nDoes not report the used/free disk space on the partitions.</p>\n<pre class=\"terminal\">$ lsblk&#13;\nNAME   MAJ:MIN RM   SIZE RO TYPE MOUNTPOINT&#13;\nsda      8:0    0 465.8G  0 disk &#13;\n├─sda1   8:1    0    70G  0 part &#13;\n├─sda2   8:2    0     1K  0 part &#13;\n├─sda5   8:5    0  97.7G  0 part /media/4668484A68483B47&#13;\n├─sda6   8:6    0  97.7G  0 part /&#13;\n├─sda7   8:7    0   1.9G  0 part [SWAP]&#13;\n└─sda8   8:8    0 198.5G  0 part /media/13f35f59-f023-4d98-b06f-9dfaebefd6c1&#13;\nsdb      8:16   1   3.8G  0 disk &#13;\n└─sdb1   8:17   1   3.8G  0 part &#13;\nsr0     11:0    1  1024M  0 rom</pre>\n<p>If there is no MOUNTPOINT, then it means that the file system is not yet mounted. For cd/dvd this means that there is no disk.</p>\n<p>Lsblk is capbale of displaying more information about each device like the label and model. Check out the man page for more information</p>\n<h3>8. blkid</h3>\n<p>Prints the block device (partitions and storage media) attributes like uuid and file system type. Does not report the space on the partitions.</p>\n<pre class=\"terminal\">$ sudo blkid&#13;\n/dev/sda1: UUID=\"5E38BE8B38BE6227\" TYPE=\"ntfs\" &#13;\n/dev/sda5: UUID=\"4668484A68483B47\" TYPE=\"ntfs\" &#13;\n/dev/sda6: UUID=\"6fa5a72a-ba26-4588-a103-74bb6b33a763\" TYPE=\"ext4\" &#13;\n/dev/sda7: UUID=\"94443023-34a1-4428-8f65-2fb02e571dae\" TYPE=\"swap\" &#13;\n/dev/sda8: UUID=\"13f35f59-f023-4d98-b06f-9dfaebefd6c1\" TYPE=\"ext4\" &#13;\n/dev/sdb1: UUID=\"08D1-8024\" TYPE=\"vfat\"</pre>\n<h3>9. hwinfo</h3>\n<p>The hwinfo is a general purpose hardware information tool and can be used to print out the disk and partition list. The output however does not print details about each partition like the above commands.</p>\n<pre class=\"terminal\">$ hwinfo --block --short&#13;\ndisk:                                                           &#13;\n  /dev/sda             ST3500418AS&#13;\n  /dev/sdb             Sony Storage Media&#13;\npartition:&#13;\n  /dev/sda1            Partition&#13;\n  /dev/sda2            Partition&#13;\n  /dev/sda5            Partition&#13;\n  /dev/sda6            Partition&#13;\n  /dev/sda7            Partition&#13;\n  /dev/sda8            Partition&#13;\n  /dev/sdb1            Partition&#13;\ncdrom:&#13;\n  /dev/sr0             SONY DVD RW DRU-190A</pre>\n<h3>Summary</h3>\n<p>The output of parted is concise and complete to get an overview of different partitions, file system on them and the total space. Pydf and df are limited to showing only mounted file systems and the same on them.</p>\n<p>Fdisk and Sfdisk show a whole lot of information that can take sometime to interpret whereas, Cfdisk is an interactive partitioning tool that display a single device at a time.</p>\n<p>So try them out, and do not forget to comment below.</p>\n<div class=\"updated_on\">Last Updated On : 26th March 2018</div>\n<div id=\"dpsp-content-bottom\" class=\"dpsp-content-wrapper dpsp-shape-rectangular dpsp-column-auto dpsp-has-spacing dpsp-hide-on-mobile dpsp-button-style-1 dpsp-has-icon-background dpsp-has-button-background\"><ul class=\"dpsp-networks-btns-wrapper dpsp-networks-btns-content\"><li><a rel=\"nofollow\" href=\"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Fwww.binarytides.com%2Flinux-command-check-disk-partitions%2F&amp;t=9%20commands%20to%20check%20hard%20disk%20partitions%20and%20disk%20space%20on%20Linux\" class=\"dpsp-network-btn dpsp-facebook dpsp-first\">Facebook</a></li><li><a rel=\"nofollow\" href=\"https://twitter.com/intent/tweet?text=9%20commands%20to%20check%20hard%20disk%20partitions%20and%20disk%20space%20on%20Linux&amp;url=https%3A%2F%2Fwww.binarytides.com%2Flinux-command-check-disk-partitions%2F\" class=\"dpsp-network-btn dpsp-twitter\">Twitter</a></li><li><a rel=\"nofollow\" href=\"#\" class=\"dpsp-network-btn dpsp-pinterest dpsp-last\">Pinterest</a></li></ul></div>", " In this post we are taking a look at some commands that can be used to check up the partitions on your system. The commands would check what partitions there are on each disk and other details like the total size, used up space and file system etc.    Commands like fdisk, sfdisk and cfdisk are general partitioning tools that can not only display the partition information, but also modify them. 1. fdisk Fdisk is the most commonly used command to check the partitions on a disk. The fdisk command can display the partitions and details like file system type. However it does not report the size of each partitions. $ sudo fdisk -l\r\n\r\nDisk /dev/sda: 500.1 GB, 500107862016 bytes\r\n255 heads, 63 sectors/track, 60801 cylinders, total 976773168 sectors\r\nUnits = sectors of 1 * 512 = 512 bytes\r\nSector size (logical/physical): 512 bytes / 512 bytes\r\nI/O size (minimum/optimal): 512 bytes / 512 bytes\r\nDisk identifier: 0x30093008\r\n\r\n   Device Boot      Start         End      Blocks   Id  System\r\n/dev/sda1   *          63   146801969    73400953+   7  HPFS/NTFS/exFAT\r\n/dev/sda2       146802031   976771071   414984520+   f  W95 Ext'd (LBA)\r\n/dev/sda5       146802033   351614654   102406311    7  HPFS/NTFS/exFAT\r\n/dev/sda6       351614718   556427339   102406311   83  Linux\r\n/dev/sda7       556429312   560427007     1998848   82  Linux swap / Solaris\r\n/dev/sda8       560429056   976771071   208171008   83  Linux\r\n\r\nDisk /dev/sdb: 4048 MB, 4048551936 bytes\r\n54 heads, 9 sectors/track, 16270 cylinders, total 7907328 sectors\r\nUnits = sectors of 1 * 512 = 512 bytes\r\nSector size (logical/physical): 512 bytes / 512 bytes\r\nI/O size (minimum/optimal): 512 bytes / 512 bytes\r\nDisk identifier: 0x0001135d\r\n\r\n   Device Boot      Start         End      Blocks   Id  System\r\n/dev/sdb1   *        2048     7907327     3952640    b  W95 FAT32 Each device is reported separately with details about size, seconds, id and individual partitions. 2. sfdisk Sfdisk is another utility with a purpose similar to fdisk, but with more features. It can display the size of each partition in MB. $ sudo sfdisk -l -uM\r\n\r\nDisk /dev/sda: 60801 cylinders, 255 heads, 63 sectors/track\r\nWarning: extended partition does not start at a cylinder boundary.\r\nDOS and Linux will interpret the contents differently.\r\nUnits = mebibytes of 1048576 bytes, blocks of 1024 bytes, counting from 0\r\n\r\n   Device Boot Start   End    MiB    #blocks   Id  System\r\n/dev/sda1   *     0+ 71680- 71681-  73400953+   7  HPFS/NTFS/exFAT\r\n/dev/sda2     71680+ 476938  405259- 414984520+   f  W95 Ext'd (LBA)\r\n/dev/sda3         0      -      0          0    0  Empty\r\n/dev/sda4         0      -      0          0    0  Empty\r\n/dev/sda5     71680+ 171686- 100007- 102406311    7  HPFS/NTFS/exFAT\r\n/dev/sda6     171686+ 271693- 100007- 102406311   83  Linux\r\n/dev/sda7     271694  273645   1952    1998848   82  Linux swap / Solaris\r\n/dev/sda8     273647  476938  203292  208171008   83  Linux\r\n\r\nDisk /dev/sdb: 1020 cylinders, 125 heads, 62 sectors/track\r\nWarning: The partition table looks like it was made\r\n  for C/H/S=*/54/9 (instead of 1020/125/62).\r\nFor this listing I'll assume that geometry.\r\nUnits = mebibytes of 1048576 bytes, blocks of 1024 bytes, counting from 0\r\n\r\n   Device Boot Start   End    MiB    #blocks   Id  System\r\n/dev/sdb1   *     1   3860   3860    3952640    b  W95 FAT32\r\n                start: (c,h,s) expected (4,11,6) found (0,32,33)\r\n                end: (c,h,s) expected (1023,53,9) found (492,53,9)\r\n/dev/sdb2         0      -      0          0    0  Empty\r\n/dev/sdb3         0      -      0          0    0  Empty\r\n/dev/sdb4         0      -      0          0    0  Empty   3. cfdisk Cfdisk is a linux partition editor with an interactive user interface based on ncurses. It can be used to list out the existing partitions as well as create or modify them. Here is an example of how to use cfdisk to list the partitions. Cfdisk works with one partition at a time. So if you need to see the details of a particular disk, then pass the device name to cfdisk. $ sudo cfdisk /dev/sdb 4. parted Parted is yet another command line utility to list out partitions and modify them if needed. Here is an example that lists out the partition details. $ sudo parted -l\r\nModel: ATA ST3500418AS (scsi)\r\nDisk /dev/sda: 500GB\r\nSector size (logical/physical): 512B/512B\r\nPartition Table: msdos\r\n\r\nNumber  Start   End     Size    Type      File system     Flags\r\n 1      32.3kB  75.2GB  75.2GB  primary   ntfs            boot\r\n 2      75.2GB  500GB   425GB   extended                  lba\r\n 5      75.2GB  180GB   105GB   logical   ntfs\r\n 6      180GB   285GB   105GB   logical   ext4\r\n 7      285GB   287GB   2047MB  logical   linux-swap(v1)\r\n 8      287GB   500GB   213GB   logical   ext4\r\n\r\n\r\nModel: Sony Storage Media (scsi)\r\nDisk /dev/sdb: 4049MB\r\nSector size (logical/physical): 512B/512B\r\nPartition Table: msdos\r\n\r\nNumber  Start   End     Size    Type     File system  Flags\r\n 1      1049kB  4049MB  4048MB  primary  fat32        boot 5. df Df is not a partitioning utility, but prints out details about only mounted file systems. The list generated by df even includes file systems that are not real disk partitions. Here is a simple example $ df -h\r\nFilesystem      Size  Used Avail Use% Mounted on\r\n/dev/sda6        97G   43G   49G  48% /\r\nnone            4.0K     0  4.0K   0% /sys/fs/cgroup\r\nudev            3.9G  8.0K  3.9G   1% /dev\r\ntmpfs           799M  1.7M  797M   1% /run\r\nnone            5.0M     0  5.0M   0% /run/lock\r\nnone            3.9G   12M  3.9G   1% /run/shm\r\nnone            100M   20K  100M   1% /run/user\r\n/dev/sda8       196G  154G   33G  83% /media/13f35f59-f023-4d98-b06f-9dfaebefd6c1\r\n/dev/sda5        98G   37G   62G  38% /media/4668484A68483B47 Only the file systems that start with a /dev are actual devices or partitions. Use grep to filter out real hard disk partitions/file systems. $ df -h | grep ^/dev\r\n/dev/sda6        97G   43G   49G  48% /\r\n/dev/sda8       196G  154G   33G  83% /media/13f35f59-f023-4d98-b06f-9dfaebefd6c1\r\n/dev/sda5        98G   37G   62G  38% /media/4668484A68483B47 To display only real disk partitions along with partition type, use df like this $ df -h --output=source,fstype,size,used,avail,pcent,target -x tmpfs -x devtmpfs\r\nFilesystem     Type     Size  Used Avail Use% Mounted on\r\n/dev/sda6      ext4      97G   43G   49G  48% /\r\n/dev/sda8      ext4     196G  154G   33G  83% /media/13f35f59-f023-4d98-b06f-9dfaebefd6c1\r\n/dev/sda5      fuseblk   98G   37G   62G  38% /media/4668484A68483B47 Note that df shows only the mounted file systems or partitions and not all. 6. pydf Improved version of df, written in python. Prints out all the hard disk partitions in a easy to read manner. $ pydf\r\nFilesystem Size Used Avail Use%             Mounted on                                 \r\n/dev/sda6   96G  43G   48G 44.7 [####.....] /                                          \r\n/dev/sda8  195G 153G   32G 78.4 [#######..] /media/13f35f59-f023-4d98-b06f-9dfaebefd6c1\r\n/dev/sda5   98G  36G   61G 37.1 [###......] /media/4668484A68483B47 Again, pydf is limited to showing only the mounted file systems. 7. lsblk Lists out all the storage blocks, which includes disk partitions and optical drives. Details include the total size of the partition/block and the mount point if any. Does not report the used/free disk space on the partitions. $ lsblk\r\nNAME   MAJ:MIN RM   SIZE RO TYPE MOUNTPOINT\r\nsda      8:0    0 465.8G  0 disk \r\n├─sda1   8:1    0    70G  0 part \r\n├─sda2   8:2    0     1K  0 part \r\n├─sda5   8:5    0  97.7G  0 part /media/4668484A68483B47\r\n├─sda6   8:6    0  97.7G  0 part /\r\n├─sda7   8:7    0   1.9G  0 part [SWAP]\r\n└─sda8   8:8    0 198.5G  0 part /media/13f35f59-f023-4d98-b06f-9dfaebefd6c1\r\nsdb      8:16   1   3.8G  0 disk \r\n└─sdb1   8:17   1   3.8G  0 part \r\nsr0     11:0    1  1024M  0 rom If there is no MOUNTPOINT, then it means that the file system is not yet mounted. For cd/dvd this means that there is no disk. Lsblk is capbale of displaying more information about each device like the label and model. Check out the man page for more information 8. blkid Prints the block device (partitions and storage media) attributes like uuid and file system type. Does not report the space on the partitions. $ sudo blkid\r\n/dev/sda1: UUID=\"5E38BE8B38BE6227\" TYPE=\"ntfs\" \r\n/dev/sda5: UUID=\"4668484A68483B47\" TYPE=\"ntfs\" \r\n/dev/sda6: UUID=\"6fa5a72a-ba26-4588-a103-74bb6b33a763\" TYPE=\"ext4\" \r\n/dev/sda7: UUID=\"94443023-34a1-4428-8f65-2fb02e571dae\" TYPE=\"swap\" \r\n/dev/sda8: UUID=\"13f35f59-f023-4d98-b06f-9dfaebefd6c1\" TYPE=\"ext4\" \r\n/dev/sdb1: UUID=\"08D1-8024\" TYPE=\"vfat\" 9. hwinfo The hwinfo is a general purpose hardware information tool and can be used to print out the disk and partition list. The output however does not print details about each partition like the above commands. $ hwinfo --block --short\r\ndisk:                                                           \r\n  /dev/sda             ST3500418AS\r\n  /dev/sdb             Sony Storage Media\r\npartition:\r\n  /dev/sda1            Partition\r\n  /dev/sda2            Partition\r\n  /dev/sda5            Partition\r\n  /dev/sda6            Partition\r\n  /dev/sda7            Partition\r\n  /dev/sda8            Partition\r\n  /dev/sdb1            Partition\r\ncdrom:\r\n  /dev/sr0             SONY DVD RW DRU-190A Summary The output of parted is concise and complete to get an overview of different partitions, file system on them and the total space. Pydf and df are limited to showing only mounted file systems and the same on them. Fdisk and Sfdisk show a whole lot of information that can take sometime to interpret whereas, Cfdisk is an interactive partitioning tool that display a single device at a time. So try them out, and do not forget to comment below. Last Updated On : 26th March 2018 Facebook Twitter Pinterest", "Fri Aug 09 15:18:52 UTC 2019", "Fri Aug 09 15:18:56 UTC 2019", "text/html", "8", "www.binarytides.com", "https://www.binarytides.com/blog/wp-content/uploads/2014/06/linux-cfdisk.png", "200", "/api/entries/14013", "1641690265132466176"], "is_starred": 0, "user_name": "admin", "user_email": "rahul.singh@anant.us", "user_id": 1, "tags": ["linux"], "slugs": ["linux"], "is_public": false, "id": "14013", "title": "9 commands to check hard disk partitions and disk space on Linux", "url": "https://www.binarytides.com/linux-command-check-disk-partitions/", "content_text": " In this post we are taking a look at some commands that can be used to check up the partitions on your system. The commands would check what partitions there are on each disk and other details like the total size, used up space and file system etc.    Commands like fdisk, sfdisk and cfdisk are general partitioning tools that can not only display the partition information, but also modify them. 1. fdisk Fdisk is the most commonly used command to check the partitions on a disk. The fdisk command can display the partitions and details like file system type. However it does not report the size of each partitions. $ sudo fdisk -l\r\n\r\nDisk /dev/sda: 500.1 GB, 500107862016 bytes\r\n255 heads, 63 sectors/track, 60801 cylinders, total 976773168 sectors\r\nUnits = sectors of 1 * 512 = 512 bytes\r\nSector size (logical/physical): 512 bytes / 512 bytes\r\nI/O size (minimum/optimal): 512 bytes / 512 bytes\r\nDisk identifier: 0x30093008\r\n\r\n   Device Boot      Start         End      Blocks   Id  System\r\n/dev/sda1   *          63   146801969    73400953+   7  HPFS/NTFS/exFAT\r\n/dev/sda2       146802031   976771071   414984520+   f  W95 Ext'd (LBA)\r\n/dev/sda5       146802033   351614654   102406311    7  HPFS/NTFS/exFAT\r\n/dev/sda6       351614718   556427339   102406311   83  Linux\r\n/dev/sda7       556429312   560427007     1998848   82  Linux swap / Solaris\r\n/dev/sda8       560429056   976771071   208171008   83  Linux\r\n\r\nDisk /dev/sdb: 4048 MB, 4048551936 bytes\r\n54 heads, 9 sectors/track, 16270 cylinders, total 7907328 sectors\r\nUnits = sectors of 1 * 512 = 512 bytes\r\nSector size (logical/physical): 512 bytes / 512 bytes\r\nI/O size (minimum/optimal): 512 bytes / 512 bytes\r\nDisk identifier: 0x0001135d\r\n\r\n   Device Boot      Start         End      Blocks   Id  System\r\n/dev/sdb1   *        2048     7907327     3952640    b  W95 FAT32 Each device is reported separately with details about size, seconds, id and individual partitions. 2. sfdisk Sfdisk is another utility with a purpose similar to fdisk, but with more features. It can display the size of each partition in MB. $ sudo sfdisk -l -uM\r\n\r\nDisk /dev/sda: 60801 cylinders, 255 heads, 63 sectors/track\r\nWarning: extended partition does not start at a cylinder boundary.\r\nDOS and Linux will interpret the contents differently.\r\nUnits = mebibytes of 1048576 bytes, blocks of 1024 bytes, counting from 0\r\n\r\n   Device Boot Start   End    MiB    #blocks   Id  System\r\n/dev/sda1   *     0+ 71680- 71681-  73400953+   7  HPFS/NTFS/exFAT\r\n/dev/sda2     71680+ 476938  405259- 414984520+   f  W95 Ext'd (LBA)\r\n/dev/sda3         0      -      0          0    0  Empty\r\n/dev/sda4         0      -      0          0    0  Empty\r\n/dev/sda5     71680+ 171686- 100007- 102406311    7  HPFS/NTFS/exFAT\r\n/dev/sda6     171686+ 271693- 100007- 102406311   83  Linux\r\n/dev/sda7     271694  273645   1952    1998848   82  Linux swap / Solaris\r\n/dev/sda8     273647  476938  203292  208171008   83  Linux\r\n\r\nDisk /dev/sdb: 1020 cylinders, 125 heads, 62 sectors/track\r\nWarning: The partition table looks like it was made\r\n  for C/H/S=*/54/9 (instead of 1020/125/62).\r\nFor this listing I'll assume that geometry.\r\nUnits = mebibytes of 1048576 bytes, blocks of 1024 bytes, counting from 0\r\n\r\n   Device Boot Start   End    MiB    #blocks   Id  System\r\n/dev/sdb1   *     1   3860   3860    3952640    b  W95 FAT32\r\n                start: (c,h,s) expected (4,11,6) found (0,32,33)\r\n                end: (c,h,s) expected (1023,53,9) found (492,53,9)\r\n/dev/sdb2         0      -      0          0    0  Empty\r\n/dev/sdb3         0      -      0          0    0  Empty\r\n/dev/sdb4         0      -      0          0    0  Empty   3. cfdisk Cfdisk is a linux partition editor with an interactive user interface based on ncurses. It can be used to list out the existing partitions as well as create or modify them. Here is an example of how to use cfdisk to list the partitions. Cfdisk works with one partition at a time. So if you need to see the details of a particular disk, then pass the device name to cfdisk. $ sudo cfdisk /dev/sdb 4. parted Parted is yet another command line utility to list out partitions and modify them if needed. Here is an example that lists out the partition details. $ sudo parted -l\r\nModel: ATA ST3500418AS (scsi)\r\nDisk /dev/sda: 500GB\r\nSector size (logical/physical): 512B/512B\r\nPartition Table: msdos\r\n\r\nNumber  Start   End     Size    Type      File system     Flags\r\n 1      32.3kB  75.2GB  75.2GB  primary   ntfs            boot\r\n 2      75.2GB  500GB   425GB   extended                  lba\r\n 5      75.2GB  180GB   105GB   logical   ntfs\r\n 6      180GB   285GB   105GB   logical   ext4\r\n 7      285GB   287GB   2047MB  logical   linux-swap(v1)\r\n 8      287GB   500GB   213GB   logical   ext4\r\n\r\n\r\nModel: Sony Storage Media (scsi)\r\nDisk /dev/sdb: 4049MB\r\nSector size (logical/physical): 512B/512B\r\nPartition Table: msdos\r\n\r\nNumber  Start   End     Size    Type     File system  Flags\r\n 1      1049kB  4049MB  4048MB  primary  fat32        boot 5. df Df is not a partitioning utility, but prints out details about only mounted file systems. The list generated by df even includes file systems that are not real disk partitions. Here is a simple example $ df -h\r\nFilesystem      Size  Used Avail Use% Mounted on\r\n/dev/sda6        97G   43G   49G  48% /\r\nnone            4.0K     0  4.0K   0% /sys/fs/cgroup\r\nudev            3.9G  8.0K  3.9G   1% /dev\r\ntmpfs           799M  1.7M  797M   1% /run\r\nnone            5.0M     0  5.0M   0% /run/lock\r\nnone            3.9G   12M  3.9G   1% /run/shm\r\nnone            100M   20K  100M   1% /run/user\r\n/dev/sda8       196G  154G   33G  83% /media/13f35f59-f023-4d98-b06f-9dfaebefd6c1\r\n/dev/sda5        98G   37G   62G  38% /media/4668484A68483B47 Only the file systems that start with a /dev are actual devices or partitions. Use grep to filter out real hard disk partitions/file systems. $ df -h | grep ^/dev\r\n/dev/sda6        97G   43G   49G  48% /\r\n/dev/sda8       196G  154G   33G  83% /media/13f35f59-f023-4d98-b06f-9dfaebefd6c1\r\n/dev/sda5        98G   37G   62G  38% /media/4668484A68483B47 To display only real disk partitions along with partition type, use df like this $ df -h --output=source,fstype,size,used,avail,pcent,target -x tmpfs -x devtmpfs\r\nFilesystem     Type     Size  Used Avail Use% Mounted on\r\n/dev/sda6      ext4      97G   43G   49G  48% /\r\n/dev/sda8      ext4     196G  154G   33G  83% /media/13f35f59-f023-4d98-b06f-9dfaebefd6c1\r\n/dev/sda5      fuseblk   98G   37G   62G  38% /media/4668484A68483B47 Note that df shows only the mounted file systems or partitions and not all. 6. pydf Improved version of df, written in python. Prints out all the hard disk partitions in a easy to read manner. $ pydf\r\nFilesystem Size Used Avail Use%             Mounted on                                 \r\n/dev/sda6   96G  43G   48G 44.7 [####.....] /                                          \r\n/dev/sda8  195G 153G   32G 78.4 [#######..] /media/13f35f59-f023-4d98-b06f-9dfaebefd6c1\r\n/dev/sda5   98G  36G   61G 37.1 [###......] /media/4668484A68483B47 Again, pydf is limited to showing only the mounted file systems. 7. lsblk Lists out all the storage blocks, which includes disk partitions and optical drives. Details include the total size of the partition/block and the mount point if any. Does not report the used/free disk space on the partitions. $ lsblk\r\nNAME   MAJ:MIN RM   SIZE RO TYPE MOUNTPOINT\r\nsda      8:0    0 465.8G  0 disk \r\n├─sda1   8:1    0    70G  0 part \r\n├─sda2   8:2    0     1K  0 part \r\n├─sda5   8:5    0  97.7G  0 part /media/4668484A68483B47\r\n├─sda6   8:6    0  97.7G  0 part /\r\n├─sda7   8:7    0   1.9G  0 part [SWAP]\r\n└─sda8   8:8    0 198.5G  0 part /media/13f35f59-f023-4d98-b06f-9dfaebefd6c1\r\nsdb      8:16   1   3.8G  0 disk \r\n└─sdb1   8:17   1   3.8G  0 part \r\nsr0     11:0    1  1024M  0 rom If there is no MOUNTPOINT, then it means that the file system is not yet mounted. For cd/dvd this means that there is no disk. Lsblk is capbale of displaying more information about each device like the label and model. Check out the man page for more information 8. blkid Prints the block device (partitions and storage media) attributes like uuid and file system type. Does not report the space on the partitions. $ sudo blkid\r\n/dev/sda1: UUID=\"5E38BE8B38BE6227\" TYPE=\"ntfs\" \r\n/dev/sda5: UUID=\"4668484A68483B47\" TYPE=\"ntfs\" \r\n/dev/sda6: UUID=\"6fa5a72a-ba26-4588-a103-74bb6b33a763\" TYPE=\"ext4\" \r\n/dev/sda7: UUID=\"94443023-34a1-4428-8f65-2fb02e571dae\" TYPE=\"swap\" \r\n/dev/sda8: UUID=\"13f35f59-f023-4d98-b06f-9dfaebefd6c1\" TYPE=\"ext4\" \r\n/dev/sdb1: UUID=\"08D1-8024\" TYPE=\"vfat\" 9. hwinfo The hwinfo is a general purpose hardware information tool and can be used to print out the disk and partition list. The output however does not print details about each partition like the above commands. $ hwinfo --block --short\r\ndisk:                                                           \r\n  /dev/sda             ST3500418AS\r\n  /dev/sdb             Sony Storage Media\r\npartition:\r\n  /dev/sda1            Partition\r\n  /dev/sda2            Partition\r\n  /dev/sda5            Partition\r\n  /dev/sda6            Partition\r\n  /dev/sda7            Partition\r\n  /dev/sda8            Partition\r\n  /dev/sdb1            Partition\r\ncdrom:\r\n  /dev/sr0             SONY DVD RW DRU-190A Summary The output of parted is concise and complete to get an overview of different partitions, file system on them and the total space. Pydf and df are limited to showing only mounted file systems and the same on them. Fdisk and Sfdisk show a whole lot of information that can take sometime to interpret whereas, Cfdisk is an interactive partitioning tool that display a single device at a time. So try them out, and do not forget to comment below. Last Updated On : 26th March 2018 Facebook Twitter Pinterest", "created_at": "2019-08-09T15:18:52Z", "updated_at": "2019-08-09T15:18:56Z", "mimetype": "text/html", "reading_time": 8, "domain_name": "www.binarytides.com", "preview_picture": "https://www.binarytides.com/blog/wp-content/uploads/2014/06/linux-cfdisk.png", "http_status": 200, "_links": ["/api/entries/14013"], "content": "<div id=\"post_start\">\n<p>In this post we are taking a look at some commands that can be used to check up the partitions on your system. The commands would check what partitions there are on each disk and other details like the total size, used up space and file system etc.</p>\n<pre class=\"adflexi\">\n\n\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-5814774904969415\" data-ad-slot=\"0700059493\">\n\n\n</ins></pre></div>\n\n\n\n\n\n<p>Commands like fdisk, sfdisk and cfdisk are general partitioning tools that can not only display the partition information, but also modify them.</p>\n<h3>1. fdisk</h3>\n<p>Fdisk is the most commonly used command to check the partitions on a disk. The fdisk command can display the partitions and details like file system type. However it does not report the size of each partitions.</p>\n<pre class=\"terminal\">$ sudo fdisk -l&#13;\n&#13;\nDisk /dev/sda: 500.1 GB, 500107862016 bytes&#13;\n255 heads, 63 sectors/track, 60801 cylinders, total 976773168 sectors&#13;\nUnits = sectors of 1 * 512 = 512 bytes&#13;\nSector size (logical/physical): 512 bytes / 512 bytes&#13;\nI/O size (minimum/optimal): 512 bytes / 512 bytes&#13;\nDisk identifier: 0x30093008&#13;\n&#13;\n   Device Boot      Start         End      Blocks   Id  System&#13;\n/dev/sda1   *          63   146801969    73400953+   7  HPFS/NTFS/exFAT&#13;\n/dev/sda2       146802031   976771071   414984520+   f  W95 Ext'd (LBA)&#13;\n/dev/sda5       146802033   351614654   102406311    7  HPFS/NTFS/exFAT&#13;\n/dev/sda6       351614718   556427339   102406311   83  Linux&#13;\n/dev/sda7       556429312   560427007     1998848   82  Linux swap / Solaris&#13;\n/dev/sda8       560429056   976771071   208171008   83  Linux&#13;\n&#13;\nDisk /dev/sdb: 4048 MB, 4048551936 bytes&#13;\n54 heads, 9 sectors/track, 16270 cylinders, total 7907328 sectors&#13;\nUnits = sectors of 1 * 512 = 512 bytes&#13;\nSector size (logical/physical): 512 bytes / 512 bytes&#13;\nI/O size (minimum/optimal): 512 bytes / 512 bytes&#13;\nDisk identifier: 0x0001135d&#13;\n&#13;\n   Device Boot      Start         End      Blocks   Id  System&#13;\n/dev/sdb1   *        2048     7907327     3952640    b  W95 FAT32</pre>\n<p>Each device is reported separately with details about size, seconds, id and individual partitions.</p>\n<h3>2. sfdisk</h3>\n<p>Sfdisk is another utility with a purpose similar to fdisk, but with more features. It can display the size of each partition in MB.</p>\n<pre class=\"terminal\">$ sudo sfdisk -l -uM&#13;\n&#13;\nDisk /dev/sda: 60801 cylinders, 255 heads, 63 sectors/track&#13;\nWarning: extended partition does not start at a cylinder boundary.&#13;\nDOS and Linux will interpret the contents differently.&#13;\nUnits = mebibytes of 1048576 bytes, blocks of 1024 bytes, counting from 0&#13;\n&#13;\n   Device Boot Start   End    MiB    #blocks   Id  System&#13;\n/dev/sda1   *     0+ 71680- 71681-  73400953+   7  HPFS/NTFS/exFAT&#13;\n/dev/sda2     71680+ 476938  405259- 414984520+   f  W95 Ext'd (LBA)&#13;\n/dev/sda3         0      -      0          0    0  Empty&#13;\n/dev/sda4         0      -      0          0    0  Empty&#13;\n/dev/sda5     71680+ 171686- 100007- 102406311    7  HPFS/NTFS/exFAT&#13;\n/dev/sda6     171686+ 271693- 100007- 102406311   83  Linux&#13;\n/dev/sda7     271694  273645   1952    1998848   82  Linux swap / Solaris&#13;\n/dev/sda8     273647  476938  203292  208171008   83  Linux&#13;\n&#13;\nDisk /dev/sdb: 1020 cylinders, 125 heads, 62 sectors/track&#13;\nWarning: The partition table looks like it was made&#13;\n  for C/H/S=*/54/9 (instead of 1020/125/62).&#13;\nFor this listing I'll assume that geometry.&#13;\nUnits = mebibytes of 1048576 bytes, blocks of 1024 bytes, counting from 0&#13;\n&#13;\n   Device Boot Start   End    MiB    #blocks   Id  System&#13;\n/dev/sdb1   *     1   3860   3860    3952640    b  W95 FAT32&#13;\n                start: (c,h,s) expected (4,11,6) found (0,32,33)&#13;\n                end: (c,h,s) expected (1023,53,9) found (492,53,9)&#13;\n/dev/sdb2         0      -      0          0    0  Empty&#13;\n/dev/sdb3         0      -      0          0    0  Empty&#13;\n/dev/sdb4         0      -      0          0    0  Empty</pre><pre class=\"adwrap\">\n\n\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-5814774904969415\" data-ad-slot=\"7125586293\">\n\n\n</ins></pre>\n\n\n<h3>3. cfdisk</h3>\n<p>Cfdisk is a linux partition editor with an interactive user interface based on ncurses. It can be used to list out the existing partitions as well as create or modify them. </p>\n<p>Here is an example of how to use cfdisk to list the partitions.</p>\n<p><img src=\"https://www.binarytides.com/blog/wp-content/uploads/2014/06/linux-cfdisk.png\" alt=\"linux cfdisk disk partitions\" width=\"640\" height=\"480\" class=\"alignnone size-full wp-image-7267\" srcset=\"https://www.binarytides.com/blog/wp-content/uploads/2014/06/linux-cfdisk.png 640w, https://www.binarytides.com/blog/wp-content/uploads/2014/06/linux-cfdisk-300x225.png 300w, https://www.binarytides.com/blog/wp-content/uploads/2014/06/linux-cfdisk-600x450.png 600w\" /></p>\n<p>Cfdisk works with one partition at a time. So if you need to see the details of a particular disk, then pass the device name to cfdisk.</p>\n<pre class=\"terminal\">$ sudo cfdisk /dev/sdb</pre>\n<h3>4. parted</h3>\n<p>Parted is yet another command line utility to list out partitions and modify them if needed.<br />\nHere is an example that lists out the partition details.</p>\n<pre class=\"terminal\">$ sudo parted -l&#13;\nModel: ATA ST3500418AS (scsi)&#13;\nDisk /dev/sda: 500GB&#13;\nSector size (logical/physical): 512B/512B&#13;\nPartition Table: msdos&#13;\n&#13;\nNumber  Start   End     Size    Type      File system     Flags&#13;\n 1      32.3kB  75.2GB  75.2GB  primary   ntfs            boot&#13;\n 2      75.2GB  500GB   425GB   extended                  lba&#13;\n 5      75.2GB  180GB   105GB   logical   ntfs&#13;\n 6      180GB   285GB   105GB   logical   ext4&#13;\n 7      285GB   287GB   2047MB  logical   linux-swap(v1)&#13;\n 8      287GB   500GB   213GB   logical   ext4&#13;\n&#13;\n&#13;\nModel: Sony Storage Media (scsi)&#13;\nDisk /dev/sdb: 4049MB&#13;\nSector size (logical/physical): 512B/512B&#13;\nPartition Table: msdos&#13;\n&#13;\nNumber  Start   End     Size    Type     File system  Flags&#13;\n 1      1049kB  4049MB  4048MB  primary  fat32        boot</pre>\n<h3>5. df</h3>\n<p>Df is not a partitioning utility, but prints out details about only mounted file systems. The list generated by df even includes file systems that are not real disk partitions.</p>\n<p>Here is a simple example</p>\n<pre class=\"terminal\">$ df -h&#13;\nFilesystem      Size  Used Avail Use% Mounted on&#13;\n/dev/sda6        97G   43G   49G  48% /&#13;\nnone            4.0K     0  4.0K   0% /sys/fs/cgroup&#13;\nudev            3.9G  8.0K  3.9G   1% /dev&#13;\ntmpfs           799M  1.7M  797M   1% /run&#13;\nnone            5.0M     0  5.0M   0% /run/lock&#13;\nnone            3.9G   12M  3.9G   1% /run/shm&#13;\nnone            100M   20K  100M   1% /run/user&#13;\n/dev/sda8       196G  154G   33G  83% /media/13f35f59-f023-4d98-b06f-9dfaebefd6c1&#13;\n/dev/sda5        98G   37G   62G  38% /media/4668484A68483B47</pre>\n<p>Only the file systems that start with a /dev are actual devices or partitions.<br />\nUse grep to filter out real hard disk partitions/file systems.</p>\n<pre class=\"terminal\">$ df -h | grep ^/dev&#13;\n/dev/sda6        97G   43G   49G  48% /&#13;\n/dev/sda8       196G  154G   33G  83% /media/13f35f59-f023-4d98-b06f-9dfaebefd6c1&#13;\n/dev/sda5        98G   37G   62G  38% /media/4668484A68483B47</pre>\n<p>To display only real disk partitions along with partition type, use df like this</p>\n<pre class=\"terminal\">$ df -h --output=source,fstype,size,used,avail,pcent,target -x tmpfs -x devtmpfs&#13;\nFilesystem     Type     Size  Used Avail Use% Mounted on&#13;\n/dev/sda6      ext4      97G   43G   49G  48% /&#13;\n/dev/sda8      ext4     196G  154G   33G  83% /media/13f35f59-f023-4d98-b06f-9dfaebefd6c1&#13;\n/dev/sda5      fuseblk   98G   37G   62G  38% /media/4668484A68483B47</pre>\n<p>Note that df shows only the mounted file systems or partitions and not all.</p>\n<h3>6. pydf</h3>\n<p>Improved version of df, written in python. Prints out all the hard disk partitions in a easy to read manner.</p>\n<pre class=\"terminal\">$ pydf&#13;\nFilesystem Size Used Avail Use%             Mounted on                                 &#13;\n/dev/sda6   96G  43G   48G 44.7 [####.....] /                                          &#13;\n/dev/sda8  195G 153G   32G 78.4 [#######..] /media/13f35f59-f023-4d98-b06f-9dfaebefd6c1&#13;\n/dev/sda5   98G  36G   61G 37.1 [###......] /media/4668484A68483B47</pre>\n<p>Again, pydf is limited to showing only the mounted file systems.</p>\n<h3>7. lsblk</h3>\n<p>Lists out all the storage blocks, which includes disk partitions and optical drives. Details include the total size of the partition/block and the mount point if any.<br />\nDoes not report the used/free disk space on the partitions.</p>\n<pre class=\"terminal\">$ lsblk&#13;\nNAME   MAJ:MIN RM   SIZE RO TYPE MOUNTPOINT&#13;\nsda      8:0    0 465.8G  0 disk &#13;\n├─sda1   8:1    0    70G  0 part &#13;\n├─sda2   8:2    0     1K  0 part &#13;\n├─sda5   8:5    0  97.7G  0 part /media/4668484A68483B47&#13;\n├─sda6   8:6    0  97.7G  0 part /&#13;\n├─sda7   8:7    0   1.9G  0 part [SWAP]&#13;\n└─sda8   8:8    0 198.5G  0 part /media/13f35f59-f023-4d98-b06f-9dfaebefd6c1&#13;\nsdb      8:16   1   3.8G  0 disk &#13;\n└─sdb1   8:17   1   3.8G  0 part &#13;\nsr0     11:0    1  1024M  0 rom</pre>\n<p>If there is no MOUNTPOINT, then it means that the file system is not yet mounted. For cd/dvd this means that there is no disk.</p>\n<p>Lsblk is capbale of displaying more information about each device like the label and model. Check out the man page for more information</p>\n<h3>8. blkid</h3>\n<p>Prints the block device (partitions and storage media) attributes like uuid and file system type. Does not report the space on the partitions.</p>\n<pre class=\"terminal\">$ sudo blkid&#13;\n/dev/sda1: UUID=\"5E38BE8B38BE6227\" TYPE=\"ntfs\" &#13;\n/dev/sda5: UUID=\"4668484A68483B47\" TYPE=\"ntfs\" &#13;\n/dev/sda6: UUID=\"6fa5a72a-ba26-4588-a103-74bb6b33a763\" TYPE=\"ext4\" &#13;\n/dev/sda7: UUID=\"94443023-34a1-4428-8f65-2fb02e571dae\" TYPE=\"swap\" &#13;\n/dev/sda8: UUID=\"13f35f59-f023-4d98-b06f-9dfaebefd6c1\" TYPE=\"ext4\" &#13;\n/dev/sdb1: UUID=\"08D1-8024\" TYPE=\"vfat\"</pre>\n<h3>9. hwinfo</h3>\n<p>The hwinfo is a general purpose hardware information tool and can be used to print out the disk and partition list. The output however does not print details about each partition like the above commands.</p>\n<pre class=\"terminal\">$ hwinfo --block --short&#13;\ndisk:                                                           &#13;\n  /dev/sda             ST3500418AS&#13;\n  /dev/sdb             Sony Storage Media&#13;\npartition:&#13;\n  /dev/sda1            Partition&#13;\n  /dev/sda2            Partition&#13;\n  /dev/sda5            Partition&#13;\n  /dev/sda6            Partition&#13;\n  /dev/sda7            Partition&#13;\n  /dev/sda8            Partition&#13;\n  /dev/sdb1            Partition&#13;\ncdrom:&#13;\n  /dev/sr0             SONY DVD RW DRU-190A</pre>\n<h3>Summary</h3>\n<p>The output of parted is concise and complete to get an overview of different partitions, file system on them and the total space. Pydf and df are limited to showing only mounted file systems and the same on them.</p>\n<p>Fdisk and Sfdisk show a whole lot of information that can take sometime to interpret whereas, Cfdisk is an interactive partitioning tool that display a single device at a time.</p>\n<p>So try them out, and do not forget to comment below.</p>\n<div class=\"updated_on\">Last Updated On : 26th March 2018</div>\n<div id=\"dpsp-content-bottom\" class=\"dpsp-content-wrapper dpsp-shape-rectangular dpsp-column-auto dpsp-has-spacing dpsp-hide-on-mobile dpsp-button-style-1 dpsp-has-icon-background dpsp-has-button-background\"><ul class=\"dpsp-networks-btns-wrapper dpsp-networks-btns-content\"><li><a rel=\"nofollow\" href=\"https://www.facebook.com/sharer/sharer.php?u=https%3A%2F%2Fwww.binarytides.com%2Flinux-command-check-disk-partitions%2F&amp;t=9%20commands%20to%20check%20hard%20disk%20partitions%20and%20disk%20space%20on%20Linux\" class=\"dpsp-network-btn dpsp-facebook dpsp-first\">Facebook</a></li><li><a rel=\"nofollow\" href=\"https://twitter.com/intent/tweet?text=9%20commands%20to%20check%20hard%20disk%20partitions%20and%20disk%20space%20on%20Linux&amp;url=https%3A%2F%2Fwww.binarytides.com%2Flinux-command-check-disk-partitions%2F\" class=\"dpsp-network-btn dpsp-twitter\">Twitter</a></li><li><a rel=\"nofollow\" href=\"#\" class=\"dpsp-network-btn dpsp-pinterest dpsp-last\">Pinterest</a></li></ul></div>"}]}}